#loc = loc(unknown)
#loc1 = loc("images")
module @yolov5s attributes {module.FLOPs = 16683511600 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "F16", module.outputs = ["350_Transpose_f32", "498_Transpose_f32", "646_Transpose_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolov5s_tpu_addressed_bm1684x_f16_weight.npz"} {
  module @yolov5s attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 14688256 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 14688256 : i64, module.neuron_addr = 4309655552 : i64, module.neuron_size = 15937536 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x3x80x80x85xf32, 4319064064 : i64>, tensor<1x3x40x40x85xf32, 4316209152 : i64>, tensor<1x3x20x20x85xf32, 4314980352 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039216000586748123, 0.0039216000586748123, 0.0039216000586748123]} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf32, 4309655552 : i64> loc(#loc1)
      %1:3 = call @subfunc_0(%0) : (tensor<1x3x640x640xf32, 4309655552 : i64>) -> (tensor<1x3x80x80x85xf32, 4319064064 : i64>, tensor<1x3x40x40x85xf32, 4316209152 : i64>, tensor<1x3x20x20x85xf32, 4314980352 : i64>) loc(#loc)
      return %1#0, %1#1, %1#2 : tensor<1x3x80x80x85xf32, 4319064064 : i64>, tensor<1x3x40x40x85xf32, 4316209152 : i64>, tensor<1x3x20x20x85xf32, 4314980352 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x640x640xf32, 4309655552 : i64> loc("images")) -> (tensor<1x3x80x80x85xf32, 4319064064 : i64>, tensor<1x3x40x40x85xf32, 4316209152 : i64>, tensor<1x3x20x20x85xf32, 4314980352 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 4294967296 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x32x1x192xf16, 4294971392 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4294983680 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x64x1x288xf16, 4294987776 : i64> loc(#loc5)
      %5 = "tpu.Group"(%arg0) ({
        %136 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 128000, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 40, 84, 128, 172, 216, 260, 304, 348, 392, 436, 476, 516, 556, 596], h_slice = [46, 50, 50, 50, 50, 50, 50, 50, 50, 50, 46, 46, 46, 46, 44], w_idx = [0], w_slice = [640], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x3x640x640xf32, 4309655552 : i64>) -> tensor<1x3x640x640xf32> loc(#loc7)
        %137 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 259136, out_size = 384, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [192], id = 1, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x192xf16, 4294971392 : i64>) -> tensor<1x32x1x192xf16> loc(#loc8)
        %138 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 195712, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 4294967296 : i64>) -> tensor<1x32x1x1xf32> loc(#loc9)
        %139 = "tpu.Cast"(%136) {ginfo = #tpu.lg<out_addr = 131072, out_size = 64000, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 40, 84, 128, 172, 216, 260, 304, 348, 392, 436, 476, 516, 556, 596], h_slice = [46, 50, 50, 50, 50, 50, 50, 50, 50, 50, 46, 46, 46, 46, 44], w_idx = [0], w_slice = [640], id = 3, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf16> loc(#loc10)
        %140 = "tpu.Conv2D"(%139, %137, %138) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 196608, out_size = 14720, buffer_addr = 212992, buffer_size = 29580, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 21, 43, 65, 87, 109, 131, 153, 175, 197, 219, 239, 259, 279, 299], h_slice = [22, 23, 23, 23, 23, 23, 23, 23, 23, 23, 21, 21, 21, 21, 21], w_idx = [0], w_slice = [320], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [6, 6], kernel_zp = 0 : i64, pads = [2, 2, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 17 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640xf16>, tensor<1x32x1x192xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x320x320xf16> loc(#loc11)
        %141 = "tpu.Cast"(%140) {ginfo = #tpu.lg<out_addr = 128000, out_size = 29440, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 21, 43, 65, 87, 109, 131, 153, 175, 197, 219, 239, 259, 279, 299], h_slice = [22, 23, 23, 23, 23, 23, 23, 23, 23, 23, 21, 21, 21, 21, 21], w_idx = [0], w_slice = [320], id = 5, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x320x320xf16>) -> tensor<1x32x320x320xf32> loc(#loc12)
        %142 = "tpu.Load"(%3) {do_bcast = false, ginfo = #tpu.lg<out_addr = 195072, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x1xf32, 4294983680 : i64>) -> tensor<1x64x1x1xf32> loc(#loc13)
        %143 = "tpu.Active"(%141) {ginfo = #tpu.lg<out_addr = 163840, out_size = 29440, buffer_addr = 196608, buffer_size = 59008, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 21, 43, 65, 87, 109, 131, 153, 175, 197, 219, 239, 259, 279, 299], h_slice = [22, 23, 23, 23, 23, 23, 23, 23, 23, 23, 21, 21, 21, 21, 21], w_idx = [0], w_slice = [320], id = 7, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x32x320x320xf32>) -> tensor<1x32x320x320xf32> loc(#loc14)
        %144 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 195136, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [288], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x288xf16, 4294987776 : i64>) -> tensor<1x64x1x288xf16> loc(#loc15)
        %145 = "tpu.Cast"(%143) {ginfo = #tpu.lg<out_addr = 128000, out_size = 14720, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 21, 43, 65, 87, 109, 131, 153, 175, 197, 219, 239, 259, 279, 299], h_slice = [22, 23, 23, 23, 23, 23, 23, 23, 23, 23, 21, 21, 21, 21, 21], w_idx = [0], w_slice = [320], id = 9, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x320x320xf32>) -> tensor<1x32x320x320xf16> loc(#loc16)
        %146 = "tpu.Conv2D"(%145, %144, %142) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 255616, out_size = 3520, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 11, 22, 33, 44, 55, 66, 77, 88, 99, 110, 120, 130, 140, 150], h_slice = [11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [160], id = 10, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320xf16>, tensor<1x64x1x288xf16>, tensor<1x64x1x1xf32>) -> tensor<1x64x160x160xf16> loc(#loc6)
        %147 = "tpu.Store"(%146, %0) {ginfo = #tpu.lg<out_addr = 255616, out_size = 3520, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 11, 22, 33, 44, 55, 66, 77, 88, 99, 110, 120, 130, 140, 150], h_slice = [11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 10, 10, 10, 10, 10], w_idx = [0], w_slice = [160], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x160x160xf16>, none) -> tensor<1x64x160x160xf16, 4314570752 : i64> loc(#loc6)
        "tpu.Yield"(%147) : (tensor<1x64x160x160xf16, 4314570752 : i64>) -> () loc(#loc6)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 1, 2, -2, 4, 0, -3, 5, -4, 7, 11, 6, -5, 9, 8, -6, 10], group_type = 0 : i64, hsecs = 15 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-6, 0], run_core_id = [], self_down_overlap_op = [11], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x640x640xf32, 4309655552 : i64>) -> tensor<1x64x160x160xf16, 4314570752 : i64> loc(#loc6)
      %6 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 4295024640 : i64> loc(#loc17)
      %7 = "top.Weight"() : () -> tensor<1x32x1x64xf16, 4295028736 : i64> loc(#loc18)
      %8 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 4295032832 : i64> loc(#loc19)
      %9 = "top.Weight"() : () -> tensor<1x32x1x32xf16, 4295036928 : i64> loc(#loc20)
      %10 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 4295041024 : i64> loc(#loc21)
      %11 = "top.Weight"() : () -> tensor<1x32x1x288xf16, 4295045120 : i64> loc(#loc22)
      %12 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 4295065600 : i64> loc(#loc23)
      %13 = "top.Weight"() : () -> tensor<1x32x1x64xf16, 4295069696 : i64> loc(#loc24)
      %14 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295073792 : i64> loc(#loc25)
      %15 = "top.Weight"() : () -> tensor<1x64x1x64xf16, 4295077888 : i64> loc(#loc26)
      %16 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4295086080 : i64> loc(#loc27)
      %17 = "top.Weight"() : () -> tensor<1x128x1x576xf16, 4295090176 : i64> loc(#loc28)
      %18 = "tpu.Group"(%5) ({
        %136 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x160x160xf16, 4314570752 : i64>) -> tensor<1x64x160x160xf16> loc(#loc30)
        %137 = "tpu.Cast"(%136) {ginfo = #tpu.lg<out_addr = 0, out_size = 36480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 1, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf16>) -> tensor<1x64x160x160xf32> loc(#loc31)
        %138 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 215296, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 4295024640 : i64>) -> tensor<1x32x1x1xf32> loc(#loc32)
        %139 = "tpu.Active"(%137) {ginfo = #tpu.lg<out_addr = 49152, out_size = 36480, buffer_addr = 114688, buffer_size = 73088, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 3, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc33)
        %140 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 204736, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x64xf16, 4295028736 : i64>) -> tensor<1x32x1x64xf16> loc(#loc34)
        %141 = "tpu.Cast"(%139) {ginfo = #tpu.lg<out_addr = 0, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 5, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf16> loc(#loc35)
        %142 = "tpu.Conv2D"(%141, %140, %138) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 6, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<1x32x1x64xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x160x160xf16> loc(#loc36)
        %143 = "tpu.Cast"(%142) {ginfo = #tpu.lg<out_addr = 18240, out_size = 36480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 7, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc37)
        %144 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 215360, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 4295032832 : i64>) -> tensor<1x32x1x1xf32> loc(#loc38)
        %145 = "tpu.Active"(%143) {ginfo = #tpu.lg<out_addr = 65536, out_size = 36480, buffer_addr = 114688, buffer_size = 73088, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 9, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc39)
        %146 = "tpu.Load"(%9) {do_bcast = false, ginfo = #tpu.lg<out_addr = 205120, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 10, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x32xf16, 4295036928 : i64>) -> tensor<1x32x1x32xf16> loc(#loc40)
        %147 = "tpu.Cast"(%145) {ginfo = #tpu.lg<out_addr = 18240, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 11, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc41)
        %148 = "tpu.Conv2D"(%147, %146, %144) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 81920, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 12, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160xf16>, tensor<1x32x1x32xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x160x160xf16> loc(#loc42)
        %149 = "tpu.Cast"(%148) {ginfo = #tpu.lg<out_addr = 36480, out_size = 36480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 13, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc43)
        %150 = "tpu.Active"(%149) {ginfo = #tpu.lg<out_addr = 81920, out_size = 36480, buffer_addr = 131072, buffer_size = 73088, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 14, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc44)
        %151 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 204160, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [288], id = 15, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x288xf16, 4295045120 : i64>) -> tensor<1x32x1x288xf16> loc(#loc45)
        %152 = "tpu.Load"(%10) {do_bcast = false, ginfo = #tpu.lg<out_addr = 215424, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 16, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 4295041024 : i64>) -> tensor<1x32x1x1xf32> loc(#loc46)
        %153 = "tpu.Cast"(%150) {ginfo = #tpu.lg<out_addr = 36480, out_size = 18240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 52, 106], h_slice = [55, 57, 54], w_idx = [0], w_slice = [160], id = 17, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc47)
        %154 = "tpu.Conv2D"(%153, %151, %152) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 81920, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 18, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160xf16>, tensor<1x32x1x288xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x160x160xf16> loc(#loc48)
        %155 = "tpu.Cast"(%154) {ginfo = #tpu.lg<out_addr = 36480, out_size = 35200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 19, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc49)
        %156 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 215488, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 20, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 4295065600 : i64>) -> tensor<1x32x1x1xf32> loc(#loc50)
        %157 = "tpu.Active"(%155) {ginfo = #tpu.lg<out_addr = 81920, out_size = 35200, buffer_addr = 131072, buffer_size = 70528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 21, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc51)
        %158 = "tpu.Cast"(%157) {ginfo = #tpu.lg<out_addr = 49152, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 22, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc52)
        %159 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 204864, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 23, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x64xf16, 4295069696 : i64>) -> tensor<1x32x1x64xf16> loc(#loc53)
        %160 = "tpu.Add"(%147, %158) {do_relu = false, ginfo = #tpu.lg<out_addr = 84352, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 24, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf16>, tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf16> loc(#loc54)
        %161 = "tpu.Conv2D"(%141, %159, %156) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 25, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<1x32x1x64xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x160x160xf16> loc(#loc55)
        %162 = "tpu.Cast"(%161) {ginfo = #tpu.lg<out_addr = 0, out_size = 35200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 26, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc56)
        %163 = "tpu.Load"(%14) {do_bcast = false, ginfo = #tpu.lg<out_addr = 215552, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 27, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x1xf32, 4295073792 : i64>) -> tensor<1x64x1x1xf32> loc(#loc57)
        %164 = "tpu.Load"(%15) {do_bcast = false, ginfo = #tpu.lg<out_addr = 204992, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 28, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xf16, 4295077888 : i64>) -> tensor<1x64x1x64xf16> loc(#loc58)
        %165 = "tpu.Active"(%162) {ginfo = #tpu.lg<out_addr = 49152, out_size = 35200, buffer_addr = 101952, buffer_size = 70528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 29, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc59)
        %166 = "tpu.Cast"(%165) {ginfo = #tpu.lg<out_addr = 0, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 30, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc60)
        %167 = "tpu.Concat"(%160, %166) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 31, stage = 1, slice_idx = 0, group_type = 0>, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf16>, tensor<1x32x160x160xf16>) -> tensor<1x64x160x160xf16> loc(#loc61)
        %168 = "tpu.Conv2D"(%167, %164, %163) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 32, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<1x64x1x64xf16>, tensor<1x64x1x1xf32>) -> tensor<1x64x160x160xf16> loc(#loc62)
        %169 = "tpu.Cast"(%168) {ginfo = #tpu.lg<out_addr = 0, out_size = 35200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 33, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf16>) -> tensor<1x64x160x160xf32> loc(#loc63)
        %170 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 212992, out_size = 2304, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [576], id = 34, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x576xf16, 4295090176 : i64>) -> tensor<1x128x1x576xf16> loc(#loc64)
        %171 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 229376, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 35, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x1xf32, 4295086080 : i64>) -> tensor<1x128x1x1xf32> loc(#loc65)
        %172 = "tpu.Active"(%169) {ginfo = #tpu.lg<out_addr = 81920, out_size = 35200, buffer_addr = 131072, buffer_size = 70528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 36, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc66)
        %173 = "tpu.Cast"(%172) {ginfo = #tpu.lg<out_addr = 0, out_size = 17600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 53, 107], h_slice = [54, 55, 53], w_idx = [0], w_slice = [160], id = 37, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf16> loc(#loc67)
        %174 = "tpu.Conv2D"(%173, %170, %171) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 98304, out_size = 8704, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 27, 54], h_slice = [27, 27, 26], w_idx = [0], w_slice = [80], id = 38, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<1x128x1x576xf16>, tensor<1x128x1x1xf32>) -> tensor<1x128x80x80xf16> loc(#loc29)
        %175 = "tpu.Store"(%174, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 8704, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 27, 54], h_slice = [27, 27, 26], w_idx = [0], w_slice = [80], id = 39, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x128x80x80xf16>, none) -> tensor<1x128x80x80xf16, 4319473664 : i64> loc(#loc29)
        "tpu.Yield"(%175) : (tensor<1x128x80x80xf16, 4319473664 : i64>) -> () loc(#loc29)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, -2, 3, 39, 2, -3, 5, 4, -4, 6, -5, 7, -6, 9, 8, -7, 11, 10, -8, 12, -9, 13, -10, 14, -11, 17, 15, 16, -12, 18, -13, 19, -14, 21, 20, -15, 22, -16, 24, 23, -17, 25, -18, 26, -19, 29, 27, 28, -20, 30, -21, 31, -22, 32, -23, 33, -24, 36, 34, 35, 0, -25, 37, -26, 38], group_type = 0 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [-19, 11], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [0], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x64x160x160xf16, 4314570752 : i64>) -> tensor<1x128x80x80xf16, 4319473664 : i64> loc(#loc29)
      %19 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295237632 : i64> loc(#loc68)
      %20 = "top.Weight"() : () -> tensor<1x64x1x128xf16, 4295241728 : i64> loc(#loc69)
      %21 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295258112 : i64> loc(#loc70)
      %22 = "top.Weight"() : () -> tensor<1x64x1x64xf16, 4295262208 : i64> loc(#loc71)
      %23 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295270400 : i64> loc(#loc72)
      %24 = "top.Weight"() : () -> tensor<1x64x1x576xf16, 4295274496 : i64> loc(#loc73)
      %25 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295348224 : i64> loc(#loc74)
      %26 = "top.Weight"() : () -> tensor<1x64x1x64xf16, 4295352320 : i64> loc(#loc75)
      %27 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295360512 : i64> loc(#loc76)
      %28 = "top.Weight"() : () -> tensor<1x64x1x576xf16, 4295364608 : i64> loc(#loc77)
      %29 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4295438336 : i64> loc(#loc78)
      %30 = "top.Weight"() : () -> tensor<1x64x1x128xf16, 4295442432 : i64> loc(#loc79)
      %31 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4295458816 : i64> loc(#loc80)
      %32 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4295462912 : i64> loc(#loc81)
      %33 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4295495680 : i64> loc(#loc82)
      %34 = "top.Weight"() : () -> tensor<1x256x1x1152xf16, 4295499776 : i64> loc(#loc83)
      %35 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296089600 : i64> loc(#loc84)
      %36 = "top.Weight"() : () -> tensor<1x128x1x256xf16, 4296093696 : i64> loc(#loc85)
      %37 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296159232 : i64> loc(#loc86)
      %38 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4296163328 : i64> loc(#loc87)
      %39 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296196096 : i64> loc(#loc88)
      %40 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4296200192 : i64> loc(#loc89)
      %41 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296495104 : i64> loc(#loc90)
      %42 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4296499200 : i64> loc(#loc91)
      %43 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296531968 : i64> loc(#loc92)
      %44 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4296536064 : i64> loc(#loc93)
      %45 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296830976 : i64> loc(#loc94)
      %46 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4296835072 : i64> loc(#loc95)
      %47 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4296867840 : i64> loc(#loc96)
      %48 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4296871936 : i64> loc(#loc97)
      %49 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4297166848 : i64> loc(#loc98)
      %50 = "top.Weight"() : () -> tensor<1x128x1x256xf16, 4297170944 : i64> loc(#loc99)
      %51 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4297236480 : i64> loc(#loc100)
      %52 = "top.Weight"() : () -> tensor<1x256x1x256xf16, 4297240576 : i64> loc(#loc101)
      %53 = "top.Weight"() : () -> tensor<1x512x1x1xf32, 4297371648 : i64> loc(#loc102)
      %54 = "top.Weight"() : () -> tensor<1x512x1x2304xf16, 4297375744 : i64> loc(#loc103)
      %55 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4299735040 : i64> loc(#loc104)
      %56 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4299739136 : i64> loc(#loc105)
      %57 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4300001280 : i64> loc(#loc106)
      %58 = "top.Weight"() : () -> tensor<1x256x1x256xf16, 4300005376 : i64> loc(#loc107)
      %59 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4300136448 : i64> loc(#loc108)
      %60 = "top.Weight"() : () -> tensor<1x256x1x2304xf16, 4300140544 : i64> loc(#loc109)
      %61 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4301320192 : i64> loc(#loc110)
      %62 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4301324288 : i64> loc(#loc111)
      %63 = "top.Weight"() : () -> tensor<1x512x1x1xf32, 4301586432 : i64> loc(#loc112)
      %64 = "top.Weight"() : () -> tensor<1x512x1x512xf16, 4301590528 : i64> loc(#loc113)
      %65 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4302114816 : i64> loc(#loc114)
      %66 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4302118912 : i64> loc(#loc115)
      %67 = "top.Weight"() : () -> tensor<1x512x1x1xf32, 4302381056 : i64> loc(#loc116)
      %68 = "top.Weight"() : () -> tensor<1x512x1x1024xf16, 4302385152 : i64> loc(#loc117)
      %69 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4303433728 : i64> loc(#loc118)
      %70 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4303437824 : i64> loc(#loc119)
      %71 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4303699968 : i64> loc(#loc120)
      %72 = "top.Weight"() : () -> tensor<1x128x1x512xf16, 4303704064 : i64> loc(#loc121)
      %73 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4303835136 : i64> loc(#loc122)
      %74 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4303839232 : i64> loc(#loc123)
      %75 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4303872000 : i64> loc(#loc124)
      %76 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4303876096 : i64> loc(#loc125)
      %77 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4304171008 : i64> loc(#loc126)
      %78 = "top.Weight"() : () -> tensor<1x128x1x512xf16, 4304175104 : i64> loc(#loc127)
      %79 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4304306176 : i64> loc(#loc128)
      %80 = "top.Weight"() : () -> tensor<1x256x1x256xf16, 4304310272 : i64> loc(#loc129)
      %81 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4304441344 : i64> loc(#loc130)
      %82 = "top.Weight"() : () -> tensor<1x128x1x256xf16, 4304445440 : i64> loc(#loc131)
      %83 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4304510976 : i64> loc(#loc132)
      %84 = "top.Weight"() : () -> tensor<1x64x1x256xf16, 4304515072 : i64> loc(#loc133)
      %85 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4304547840 : i64> loc(#loc134)
      %86 = "top.Weight"() : () -> tensor<1x64x1x64xf16, 4304551936 : i64> loc(#loc135)
      %87 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4304560128 : i64> loc(#loc136)
      %88 = "top.Weight"() : () -> tensor<1x64x1x576xf16, 4304564224 : i64> loc(#loc137)
      %89 = "top.Weight"() : () -> tensor<1x64x1x1xf32, 4304637952 : i64> loc(#loc138)
      %90 = "top.Weight"() : () -> tensor<1x64x1x256xf16, 4304642048 : i64> loc(#loc139)
      %91 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4304674816 : i64> loc(#loc140)
      %92 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4304678912 : i64> loc(#loc141)
      %93 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4304711680 : i64> loc(#loc142)
      %94 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4304715776 : i64> loc(#loc143)
      %95 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4305010688 : i64> loc(#loc144)
      %96 = "top.Weight"() : () -> tensor<1x128x1x256xf16, 4305014784 : i64> loc(#loc145)
      %97 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4305080320 : i64> loc(#loc146)
      %98 = "top.Weight"() : () -> tensor<1x128x1x128xf16, 4305084416 : i64> loc(#loc147)
      %99 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4305117184 : i64> loc(#loc148)
      %100 = "top.Weight"() : () -> tensor<1x128x1x1152xf16, 4305121280 : i64> loc(#loc149)
      %101 = "top.Weight"() : () -> tensor<1x128x1x1xf32, 4305416192 : i64> loc(#loc150)
      %102 = "top.Weight"() : () -> tensor<1x128x1x256xf16, 4305420288 : i64> loc(#loc151)
      %103 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4305485824 : i64> loc(#loc152)
      %104 = "top.Weight"() : () -> tensor<1x256x1x256xf16, 4305489920 : i64> loc(#loc153)
      %105 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4305620992 : i64> loc(#loc154)
      %106 = "top.Weight"() : () -> tensor<1x256x1x2304xf16, 4305625088 : i64> loc(#loc155)
      %107 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4306804736 : i64> loc(#loc156)
      %108 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4306808832 : i64> loc(#loc157)
      %109 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4307070976 : i64> loc(#loc158)
      %110 = "top.Weight"() : () -> tensor<1x256x1x256xf16, 4307075072 : i64> loc(#loc159)
      %111 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4307206144 : i64> loc(#loc160)
      %112 = "top.Weight"() : () -> tensor<1x256x1x2304xf16, 4307210240 : i64> loc(#loc161)
      %113 = "top.Weight"() : () -> tensor<1x256x1x1xf32, 4308389888 : i64> loc(#loc162)
      %114 = "top.Weight"() : () -> tensor<1x256x1x512xf16, 4308393984 : i64> loc(#loc163)
      %115 = "top.Weight"() : () -> tensor<1x512x1x1xf32, 4308656128 : i64> loc(#loc164)
      %116 = "top.Weight"() : () -> tensor<1x512x1x512xf16, 4308660224 : i64> loc(#loc165)
      %117:3 = "tpu.Group"(%18) ({
        %136 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 25600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x80x80xf16, 4319473664 : i64>) -> tensor<1x128x80x80xf16> loc(#loc169)
        %137 = "tpu.Cast"(%136) {ginfo = #tpu.lg<out_addr = 114688, out_size = 51200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 1, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf16>) -> tensor<1x128x80x80xf32> loc(#loc170)
        %138 = "tpu.Active"(%137) {ginfo = #tpu.lg<out_addr = 180224, out_size = 51200, buffer_addr = 0, buffer_size = 102528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 2, stage = 1, slice_idx = 0, group_type = 0>, mode = #tpu<active_mode SILU>} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc171)
        %139 = "tpu.Load"(%20) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x128xf16, 4295241728 : i64>) -> tensor<1x64x1x128xf16> loc(#loc172)
        %140 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x1xf32, 4295237632 : i64>) -> tensor<1x64x1x1xf32> loc(#loc173)
        %141 = "tpu.Cast"(%138) {ginfo = #tpu.lg<out_addr = 0, out_size = 25600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf16> loc(#loc174)
        %142 = "tpu.Conv2D"(%141, %139, %140) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 12800, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80xf16>, tensor<1x64x1x128xf16>, tensor<1x64x1x1xf32>) -> tensor<1x64x80x80xf16> loc(#loc175)
        %143 = "tpu.Cast"(%142) {ginfo = #tpu.lg<out_addr = 25600, out_size = 25600, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 7, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc176)
