ir_version: 7
producer_name: "pytorch"
producer_version: "1.10"
graph {
  node {
    input: "images"
    input: "model.0.conv.weight"
    input: "model.0.conv.bias"
    output: "122"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "122"
    output: "123"
    name: "Sigmoid_1"
    op_type: "Sigmoid"
  }
  node {
    input: "122"
    input: "123"
    output: "124"
    name: "Mul_2"
    op_type: "Mul"
  }
  node {
    input: "124"
    input: "model.1.conv.weight"
    input: "model.1.conv.bias"
    output: "125"
    name: "Conv_3"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "125"
    output: "126"
    name: "Sigmoid_4"
    op_type: "Sigmoid"
  }
  node {
    input: "125"
    input: "126"
    output: "127"
    name: "Mul_5"
    op_type: "Mul"
  }
  node {
    input: "127"
    input: "model.2.cv1.conv.weight"
    input: "model.2.cv1.conv.bias"
    output: "128"
    name: "Conv_6"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "128"
    output: "129"
    name: "Sigmoid_7"
    op_type: "Sigmoid"
  }
  node {
    input: "128"
    input: "129"
    output: "130"
    name: "Mul_8"
    op_type: "Mul"
  }
  node {
    input: "130"
    input: "model.2.m.0.cv1.conv.weight"
    input: "model.2.m.0.cv1.conv.bias"
    output: "131"
    name: "Conv_9"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "131"
    output: "132"
    name: "Sigmoid_10"
    op_type: "Sigmoid"
  }
  node {
    input: "131"
    input: "132"
    output: "133"
    name: "Mul_11"
    op_type: "Mul"
  }
  node {
    input: "133"
    input: "model.2.m.0.cv2.conv.weight"
    input: "model.2.m.0.cv2.conv.bias"
    output: "134"
    name: "Conv_12"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "134"
    output: "135"
    name: "Sigmoid_13"
    op_type: "Sigmoid"
  }
  node {
    input: "134"
    input: "135"
    output: "136"
    name: "Mul_14"
    op_type: "Mul"
  }
  node {
    input: "130"
    input: "136"
    output: "137"
    name: "Add_15"
    op_type: "Add"
  }
  node {
    input: "127"
    input: "model.2.cv2.conv.weight"
    input: "model.2.cv2.conv.bias"
    output: "138"
    name: "Conv_16"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "138"
    output: "139"
    name: "Sigmoid_17"
    op_type: "Sigmoid"
  }
  node {
    input: "138"
    input: "139"
    output: "140"
    name: "Mul_18"
    op_type: "Mul"
  }
  node {
    input: "137"
    input: "140"
    output: "141"
    name: "Concat_19"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "141"
    input: "model.2.cv3.conv.weight"
    input: "model.2.cv3.conv.bias"
    output: "142"
    name: "Conv_20"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "142"
    output: "143"
    name: "Sigmoid_21"
    op_type: "Sigmoid"
  }
  node {
    input: "142"
    input: "143"
    output: "144"
    name: "Mul_22"
    op_type: "Mul"
  }
  node {
    input: "144"
    input: "model.3.conv.weight"
    input: "model.3.conv.bias"
    output: "145"
    name: "Conv_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "145"
    output: "146"
    name: "Sigmoid_24"
    op_type: "Sigmoid"
  }
  node {
    input: "145"
    input: "146"
    output: "147"
    name: "Mul_25"
    op_type: "Mul"
  }
  node {
    input: "147"
    input: "model.4.cv1.conv.weight"
    input: "model.4.cv1.conv.bias"
    output: "148"
    name: "Conv_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "148"
    output: "149"
    name: "Sigmoid_27"
    op_type: "Sigmoid"
  }
  node {
    input: "148"
    input: "149"
    output: "150"
    name: "Mul_28"
    op_type: "Mul"
  }
  node {
    input: "150"
    input: "model.4.m.0.cv1.conv.weight"
    input: "model.4.m.0.cv1.conv.bias"
    output: "151"
    name: "Conv_29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "151"
    output: "152"
    name: "Sigmoid_30"
    op_type: "Sigmoid"
  }
  node {
    input: "151"
    input: "152"
    output: "153"
    name: "Mul_31"
    op_type: "Mul"
  }
  node {
    input: "153"
    input: "model.4.m.0.cv2.conv.weight"
    input: "model.4.m.0.cv2.conv.bias"
    output: "154"
    name: "Conv_32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "154"
    output: "155"
    name: "Sigmoid_33"
    op_type: "Sigmoid"
  }
  node {
    input: "154"
    input: "155"
    output: "156"
    name: "Mul_34"
    op_type: "Mul"
  }
  node {
    input: "150"
    input: "156"
    output: "157"
    name: "Add_35"
    op_type: "Add"
  }
  node {
    input: "157"
    input: "model.4.m.1.cv1.conv.weight"
    input: "model.4.m.1.cv1.conv.bias"
    output: "158"
    name: "Conv_36"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "158"
    output: "159"
    name: "Sigmoid_37"
    op_type: "Sigmoid"
  }
  node {
    input: "158"
    input: "159"
    output: "160"
    name: "Mul_38"
    op_type: "Mul"
  }
  node {
    input: "160"
    input: "model.4.m.1.cv2.conv.weight"
    input: "model.4.m.1.cv2.conv.bias"
    output: "161"
    name: "Conv_39"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "161"
    output: "162"
    name: "Sigmoid_40"
    op_type: "Sigmoid"
  }
  node {
    input: "161"
    input: "162"
    output: "163"
    name: "Mul_41"
    op_type: "Mul"
  }
  node {
    input: "157"
    input: "163"
    output: "164"
    name: "Add_42"
    op_type: "Add"
  }
  node {
    input: "147"
    input: "model.4.cv2.conv.weight"
    input: "model.4.cv2.conv.bias"
    output: "165"
    name: "Conv_43"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "165"
    output: "166"
    name: "Sigmoid_44"
    op_type: "Sigmoid"
  }
  node {
    input: "165"
    input: "166"
    output: "167"
    name: "Mul_45"
    op_type: "Mul"
  }
  node {
    input: "164"
    input: "167"
    output: "168"
    name: "Concat_46"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "168"
    input: "model.4.cv3.conv.weight"
    input: "model.4.cv3.conv.bias"
    output: "169"
    name: "Conv_47"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "169"
    output: "170"
    name: "Sigmoid_48"
    op_type: "Sigmoid"
  }
  node {
    input: "169"
    input: "170"
    output: "171"
    name: "Mul_49"
    op_type: "Mul"
  }
  node {
    input: "171"
    input: "model.5.conv.weight"
    input: "model.5.conv.bias"
    output: "172"
    name: "Conv_50"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "172"
    output: "173"
    name: "Sigmoid_51"
    op_type: "Sigmoid"
  }
  node {
    input: "172"
    input: "173"
    output: "174"
    name: "Mul_52"
    op_type: "Mul"
  }
  node {
    input: "174"
    input: "model.6.cv1.conv.weight"
    input: "model.6.cv1.conv.bias"
    output: "175"
    name: "Conv_53"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "175"
    output: "176"
    name: "Sigmoid_54"
    op_type: "Sigmoid"
  }
  node {
    input: "175"
    input: "176"
    output: "177"
    name: "Mul_55"
    op_type: "Mul"
  }
  node {
    input: "177"
    input: "model.6.m.0.cv1.conv.weight"
    input: "model.6.m.0.cv1.conv.bias"
    output: "178"
    name: "Conv_56"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "178"
    output: "179"
    name: "Sigmoid_57"
    op_type: "Sigmoid"
  }
  node {
    input: "178"
    input: "179"
    output: "180"
    name: "Mul_58"
    op_type: "Mul"
  }
  node {
    input: "180"
    input: "model.6.m.0.cv2.conv.weight"
    input: "model.6.m.0.cv2.conv.bias"
    output: "181"
    name: "Conv_59"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "181"
    output: "182"
    name: "Sigmoid_60"
    op_type: "Sigmoid"
  }
  node {
    input: "181"
    input: "182"
    output: "183"
    name: "Mul_61"
    op_type: "Mul"
  }
  node {
    input: "177"
    input: "183"
    output: "184"
    name: "Add_62"
    op_type: "Add"
  }
  node {
    input: "184"
    input: "model.6.m.1.cv1.conv.weight"
    input: "model.6.m.1.cv1.conv.bias"
    output: "185"
    name: "Conv_63"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "185"
    output: "186"
    name: "Sigmoid_64"
    op_type: "Sigmoid"
  }
  node {
    input: "185"
    input: "186"
    output: "187"
    name: "Mul_65"
    op_type: "Mul"
  }
  node {
    input: "187"
    input: "model.6.m.1.cv2.conv.weight"
    input: "model.6.m.1.cv2.conv.bias"
    output: "188"
    name: "Conv_66"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "188"
    output: "189"
    name: "Sigmoid_67"
    op_type: "Sigmoid"
  }
  node {
    input: "188"
    input: "189"
    output: "190"
    name: "Mul_68"
    op_type: "Mul"
  }
  node {
    input: "184"
    input: "190"
    output: "191"
    name: "Add_69"
    op_type: "Add"
  }
  node {
    input: "191"
    input: "model.6.m.2.cv1.conv.weight"
    input: "model.6.m.2.cv1.conv.bias"
    output: "192"
    name: "Conv_70"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "192"
    output: "193"
    name: "Sigmoid_71"
    op_type: "Sigmoid"
  }
  node {
    input: "192"
    input: "193"
    output: "194"
    name: "Mul_72"
    op_type: "Mul"
  }
  node {
    input: "194"
    input: "model.6.m.2.cv2.conv.weight"
    input: "model.6.m.2.cv2.conv.bias"
    output: "195"
    name: "Conv_73"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "195"
    output: "196"
    name: "Sigmoid_74"
    op_type: "Sigmoid"
  }
  node {
    input: "195"
    input: "196"
    output: "197"
    name: "Mul_75"
    op_type: "Mul"
  }
  node {
    input: "191"
    input: "197"
    output: "198"
    name: "Add_76"
    op_type: "Add"
  }
  node {
    input: "174"
    input: "model.6.cv2.conv.weight"
    input: "model.6.cv2.conv.bias"
    output: "199"
    name: "Conv_77"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "199"
    output: "200"
    name: "Sigmoid_78"
    op_type: "Sigmoid"
  }
  node {
    input: "199"
    input: "200"
    output: "201"
    name: "Mul_79"
    op_type: "Mul"
  }
  node {
    input: "198"
    input: "201"
    output: "202"
    name: "Concat_80"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "202"
    input: "model.6.cv3.conv.weight"
    input: "model.6.cv3.conv.bias"
    output: "203"
    name: "Conv_81"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "203"
    output: "204"
    name: "Sigmoid_82"
    op_type: "Sigmoid"
  }
  node {
    input: "203"
    input: "204"
    output: "205"
    name: "Mul_83"
    op_type: "Mul"
  }
  node {
    input: "205"
    input: "model.7.conv.weight"
    input: "model.7.conv.bias"
    output: "206"
    name: "Conv_84"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "206"
    output: "207"
    name: "Sigmoid_85"
    op_type: "Sigmoid"
  }
  node {
    input: "206"
    input: "207"
    output: "208"
    name: "Mul_86"
    op_type: "Mul"
  }
  node {
    input: "208"
    input: "model.8.cv1.conv.weight"
    input: "model.8.cv1.conv.bias"
    output: "209"
    name: "Conv_87"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "209"
    output: "210"
    name: "Sigmoid_88"
    op_type: "Sigmoid"
  }
  node {
    input: "209"
    input: "210"
    output: "211"
    name: "Mul_89"
    op_type: "Mul"
  }
  node {
    input: "211"
    input: "model.8.m.0.cv1.conv.weight"
    input: "model.8.m.0.cv1.conv.bias"
    output: "212"
    name: "Conv_90"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "212"
    output: "213"
    name: "Sigmoid_91"
    op_type: "Sigmoid"
  }
  node {
    input: "212"
    input: "213"
    output: "214"
    name: "Mul_92"
    op_type: "Mul"
  }
  node {
    input: "214"
    input: "model.8.m.0.cv2.conv.weight"
    input: "model.8.m.0.cv2.conv.bias"
    output: "215"
    name: "Conv_93"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "215"
    output: "216"
    name: "Sigmoid_94"
    op_type: "Sigmoid"
  }
  node {
    input: "215"
    input: "216"
    output: "217"
    name: "Mul_95"
    op_type: "Mul"
  }
  node {
    input: "211"
    input: "217"
    output: "218"
    name: "Add_96"
    op_type: "Add"
  }
  node {
    input: "208"
    input: "model.8.cv2.conv.weight"
    input: "model.8.cv2.conv.bias"
    output: "219"
    name: "Conv_97"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "219"
    output: "220"
    name: "Sigmoid_98"
    op_type: "Sigmoid"
  }
  node {
    input: "219"
    input: "220"
    output: "221"
    name: "Mul_99"
    op_type: "Mul"
  }
  node {
    input: "218"
    input: "221"
    output: "222"
    name: "Concat_100"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "222"
    input: "model.8.cv3.conv.weight"
    input: "model.8.cv3.conv.bias"
    output: "223"
    name: "Conv_101"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "223"
    output: "224"
    name: "Sigmoid_102"
    op_type: "Sigmoid"
  }
  node {
    input: "223"
    input: "224"
    output: "225"
    name: "Mul_103"
    op_type: "Mul"
  }
  node {
    input: "225"
    input: "model.9.cv1.conv.weight"
    input: "model.9.cv1.conv.bias"
    output: "226"
    name: "Conv_104"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "226"
    output: "227"
    name: "Sigmoid_105"
    op_type: "Sigmoid"
  }
  node {
    input: "226"
    input: "227"
    output: "228"
    name: "Mul_106"
    op_type: "Mul"
  }
  node {
    input: "228"
    output: "229"
    name: "MaxPool_107"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "229"
    output: "230"
    name: "MaxPool_108"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "230"
    output: "231"
    name: "MaxPool_109"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "228"
    input: "229"
    input: "230"
    input: "231"
    output: "232"
    name: "Concat_110"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "232"
    input: "model.9.cv2.conv.weight"
    input: "model.9.cv2.conv.bias"
    output: "233"
    name: "Conv_111"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "233"
    output: "234"
    name: "Sigmoid_112"
    op_type: "Sigmoid"
  }
  node {
    input: "233"
    input: "234"
    output: "235"
    name: "Mul_113"
    op_type: "Mul"
  }
  node {
    input: "235"
    input: "model.10.conv.weight"
    input: "model.10.conv.bias"
    output: "236"
    name: "Conv_114"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "236"
    output: "237"
    name: "Sigmoid_115"
    op_type: "Sigmoid"
  }
  node {
    input: "236"
    input: "237"
    output: "238"
    name: "Mul_116"
    op_type: "Mul"
  }
  node {
    input: "238"
    input: ""
    input: "771"
    output: "243"
    name: "Resize_117"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "243"
    input: "205"
    output: "244"
    name: "Concat_118"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "244"
    input: "model.13.cv1.conv.weight"
    input: "model.13.cv1.conv.bias"
    output: "245"
    name: "Conv_119"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "245"
    output: "246"
    name: "Sigmoid_120"
    op_type: "Sigmoid"
  }
  node {
    input: "245"
    input: "246"
    output: "247"
    name: "Mul_121"
    op_type: "Mul"
  }
  node {
    input: "247"
    input: "model.13.m.0.cv1.conv.weight"
    input: "model.13.m.0.cv1.conv.bias"
    output: "248"
    name: "Conv_122"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "248"
    output: "249"
    name: "Sigmoid_123"
    op_type: "Sigmoid"
  }
  node {
    input: "248"
    input: "249"
    output: "250"
    name: "Mul_124"
    op_type: "Mul"
  }
  node {
    input: "250"
    input: "model.13.m.0.cv2.conv.weight"
    input: "model.13.m.0.cv2.conv.bias"
    output: "251"
    name: "Conv_125"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "251"
    output: "252"
    name: "Sigmoid_126"
    op_type: "Sigmoid"
  }
  node {
    input: "251"
    input: "252"
    output: "253"
    name: "Mul_127"
    op_type: "Mul"
  }
  node {
    input: "244"
    input: "model.13.cv2.conv.weight"
    input: "model.13.cv2.conv.bias"
    output: "254"
    name: "Conv_128"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "254"
    output: "255"
    name: "Sigmoid_129"
    op_type: "Sigmoid"
  }
  node {
    input: "254"
    input: "255"
    output: "256"
    name: "Mul_130"
    op_type: "Mul"
  }
  node {
    input: "253"
    input: "256"
    output: "257"
    name: "Concat_131"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "257"
    input: "model.13.cv3.conv.weight"
    input: "model.13.cv3.conv.bias"
    output: "258"
    name: "Conv_132"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "258"
    output: "259"
    name: "Sigmoid_133"
    op_type: "Sigmoid"
  }
  node {
    input: "258"
    input: "259"
    output: "260"
    name: "Mul_134"
    op_type: "Mul"
  }
  node {
    input: "260"
    input: "model.14.conv.weight"
    input: "model.14.conv.bias"
    output: "261"
    name: "Conv_135"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "261"
    output: "262"
    name: "Sigmoid_136"
    op_type: "Sigmoid"
  }
  node {
    input: "261"
    input: "262"
    output: "263"
    name: "Mul_137"
    op_type: "Mul"
  }
  node {
    input: "263"
    input: ""
    input: "771"
    output: "268"
    name: "Resize_138"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "268"
    input: "171"
    output: "269"
    name: "Concat_139"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "269"
    input: "model.17.cv1.conv.weight"
    input: "model.17.cv1.conv.bias"
    output: "270"
    name: "Conv_140"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "270"
    output: "271"
    name: "Sigmoid_141"
    op_type: "Sigmoid"
  }
  node {
    input: "270"
    input: "271"
    output: "272"
    name: "Mul_142"
    op_type: "Mul"
  }
  node {
    input: "272"
    input: "model.17.m.0.cv1.conv.weight"
    input: "model.17.m.0.cv1.conv.bias"
    output: "273"
    name: "Conv_143"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "273"
    output: "274"
    name: "Sigmoid_144"
    op_type: "Sigmoid"
  }
  node {
    input: "273"
    input: "274"
    output: "275"
    name: "Mul_145"
    op_type: "Mul"
  }
  node {
    input: "275"
    input: "model.17.m.0.cv2.conv.weight"
    input: "model.17.m.0.cv2.conv.bias"
    output: "276"
    name: "Conv_146"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "276"
    output: "277"
    name: "Sigmoid_147"
    op_type: "Sigmoid"
  }
  node {
    input: "276"
    input: "277"
    output: "278"
    name: "Mul_148"
    op_type: "Mul"
  }
  node {
    input: "269"
    input: "model.17.cv2.conv.weight"
    input: "model.17.cv2.conv.bias"
    output: "279"
    name: "Conv_149"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "279"
    output: "280"
    name: "Sigmoid_150"
    op_type: "Sigmoid"
  }
  node {
    input: "279"
    input: "280"
    output: "281"
    name: "Mul_151"
    op_type: "Mul"
  }
  node {
    input: "278"
    input: "281"
    output: "282"
    name: "Concat_152"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "282"
    input: "model.17.cv3.conv.weight"
    input: "model.17.cv3.conv.bias"
    output: "283"
    name: "Conv_153"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "283"
    output: "284"
    name: "Sigmoid_154"
    op_type: "Sigmoid"
  }
  node {
    input: "283"
    input: "284"
    output: "285"
    name: "Mul_155"
    op_type: "Mul"
  }
  node {
    input: "285"
    input: "model.18.conv.weight"
    input: "model.18.conv.bias"
    output: "286"
    name: "Conv_156"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "286"
    output: "287"
    name: "Sigmoid_157"
    op_type: "Sigmoid"
  }
  node {
    input: "286"
    input: "287"
    output: "288"
    name: "Mul_158"
    op_type: "Mul"
  }
  node {
    input: "288"
    input: "263"
    output: "289"
    name: "Concat_159"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "289"
    input: "model.20.cv1.conv.weight"
    input: "model.20.cv1.conv.bias"
    output: "290"
    name: "Conv_160"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "290"
    output: "291"
    name: "Sigmoid_161"
    op_type: "Sigmoid"
  }
  node {
    input: "290"
    input: "291"
    output: "292"
    name: "Mul_162"
    op_type: "Mul"
  }
  node {
    input: "292"
    input: "model.20.m.0.cv1.conv.weight"
    input: "model.20.m.0.cv1.conv.bias"
    output: "293"
    name: "Conv_163"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "293"
    output: "294"
    name: "Sigmoid_164"
    op_type: "Sigmoid"
  }
  node {
    input: "293"
    input: "294"
    output: "295"
    name: "Mul_165"
    op_type: "Mul"
  }
  node {
    input: "295"
    input: "model.20.m.0.cv2.conv.weight"
    input: "model.20.m.0.cv2.conv.bias"
    output: "296"
    name: "Conv_166"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "296"
    output: "297"
    name: "Sigmoid_167"
    op_type: "Sigmoid"
  }
  node {
    input: "296"
    input: "297"
    output: "298"
    name: "Mul_168"
    op_type: "Mul"
  }
  node {
    input: "289"
    input: "model.20.cv2.conv.weight"
    input: "model.20.cv2.conv.bias"
    output: "299"
    name: "Conv_169"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "299"
    output: "300"
    name: "Sigmoid_170"
    op_type: "Sigmoid"
  }
  node {
    input: "299"
    input: "300"
    output: "301"
    name: "Mul_171"
    op_type: "Mul"
  }
  node {
    input: "298"
    input: "301"
    output: "302"
    name: "Concat_172"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "302"
    input: "model.20.cv3.conv.weight"
    input: "model.20.cv3.conv.bias"
    output: "303"
    name: "Conv_173"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "303"
    output: "304"
    name: "Sigmoid_174"
    op_type: "Sigmoid"
  }
  node {
    input: "303"
    input: "304"
    output: "305"
    name: "Mul_175"
    op_type: "Mul"
  }
  node {
    input: "305"
    input: "model.21.conv.weight"
    input: "model.21.conv.bias"
    output: "306"
    name: "Conv_176"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "306"
    output: "307"
    name: "Sigmoid_177"
    op_type: "Sigmoid"
  }
  node {
    input: "306"
    input: "307"
    output: "308"
    name: "Mul_178"
    op_type: "Mul"
  }
  node {
    input: "308"
    input: "238"
    output: "309"
    name: "Concat_179"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "309"
    input: "model.23.cv1.conv.weight"
    input: "model.23.cv1.conv.bias"
    output: "310"
    name: "Conv_180"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "310"
    output: "311"
    name: "Sigmoid_181"
    op_type: "Sigmoid"
  }
  node {
    input: "310"
    input: "311"
    output: "312"
    name: "Mul_182"
    op_type: "Mul"
  }
  node {
    input: "312"
    input: "model.23.m.0.cv1.conv.weight"
    input: "model.23.m.0.cv1.conv.bias"
    output: "313"
    name: "Conv_183"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "313"
    output: "314"
    name: "Sigmoid_184"
    op_type: "Sigmoid"
  }
  node {
    input: "313"
    input: "314"
    output: "315"
    name: "Mul_185"
    op_type: "Mul"
  }
  node {
    input: "315"
    input: "model.23.m.0.cv2.conv.weight"
    input: "model.23.m.0.cv2.conv.bias"
    output: "316"
    name: "Conv_186"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
