#loc = loc(unknown)
module @yolov5s attributes {module.FLOPs = 16683511600 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "yolov5s_tpu_lowered_bm1684x_f16_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x3x80x80x85xf32>, tensor<1x3x40x40x85xf32>, tensor<1x3x20x20x85xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039216000586748123, 0.0039216000586748123, 0.0039216000586748123]} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640xf16> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<32x3x6x6xf16> loc(#loc4)
    %5 = "tpu.Conv2D"(%2, %4, %3) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [6, 6], kernel_zp = 0 : i64, pads = [2, 2, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640xf16>, tensor<32x3x6x6xf16>, tensor<32xf32>) -> tensor<1x32x320x320xf16> loc(#loc5)
    %6 = "tpu.Cast"(%5) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x320x320xf16>) -> tensor<1x32x320x320xf32> loc(#loc6)
    %7 = "tpu.Active"(%6) {mode = #tpu<active_mode SILU>} : (tensor<1x32x320x320xf32>) -> tensor<1x32x320x320xf32> loc(#loc7)
    %8 = "tpu.Cast"(%7) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x320x320xf32>) -> tensor<1x32x320x320xf16> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<64xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<64x32x3x3xf16> loc(#loc10)
    %11 = "tpu.Conv2D"(%8, %10, %9) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320xf16>, tensor<64x32x3x3xf16>, tensor<64xf32>) -> tensor<1x64x160x160xf16> loc(#loc11)
    %12 = "tpu.Cast"(%11) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf16>) -> tensor<1x64x160x160xf32> loc(#loc12)
    %13 = "tpu.Active"(%12) {mode = #tpu<active_mode SILU>} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc13)
    %14 = "tpu.Cast"(%13) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf16> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<32xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<32x64x1x1xf16> loc(#loc16)
    %17 = "tpu.Conv2D"(%14, %16, %15) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<32x64x1x1xf16>, tensor<32xf32>) -> tensor<1x32x160x160xf16> loc(#loc17)
    %18 = "tpu.Cast"(%17) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc18)
    %19 = "tpu.Active"(%18) {mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc19)
    %20 = "tpu.Cast"(%19) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<32xf32> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<32x32x1x1xf16> loc(#loc22)
    %23 = "tpu.Conv2D"(%20, %22, %21) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160xf16>, tensor<32x32x1x1xf16>, tensor<32xf32>) -> tensor<1x32x160x160xf16> loc(#loc23)
    %24 = "tpu.Cast"(%23) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc24)
    %25 = "tpu.Active"(%24) {mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc25)
    %26 = "tpu.Cast"(%25) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<32xf32> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<32x32x3x3xf16> loc(#loc28)
    %29 = "tpu.Conv2D"(%26, %28, %27) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160xf16>, tensor<32x32x3x3xf16>, tensor<32xf32>) -> tensor<1x32x160x160xf16> loc(#loc29)
    %30 = "tpu.Cast"(%29) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc30)
    %31 = "tpu.Active"(%30) {mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc31)
    %32 = "tpu.Cast"(%31) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc32)
    %33 = "tpu.Add"(%20, %32) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf16>, tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf16> loc(#loc33)
    %34 = "top.Weight"() : () -> tensor<32xf32> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<32x64x1x1xf16> loc(#loc35)
    %36 = "tpu.Conv2D"(%14, %35, %34) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<32x64x1x1xf16>, tensor<32xf32>) -> tensor<1x32x160x160xf16> loc(#loc36)
    %37 = "tpu.Cast"(%36) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf16>) -> tensor<1x32x160x160xf32> loc(#loc37)
    %38 = "tpu.Active"(%37) {mode = #tpu<active_mode SILU>} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf32> loc(#loc38)
    %39 = "tpu.Cast"(%38) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x32x160x160xf32>) -> tensor<1x32x160x160xf16> loc(#loc39)
    %40 = "tpu.Concat"(%33, %39) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160xf16>, tensor<1x32x160x160xf16>) -> tensor<1x64x160x160xf16> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<64xf32> loc(#loc41)
    %42 = "top.Weight"() : () -> tensor<64x64x1x1xf16> loc(#loc42)
    %43 = "tpu.Conv2D"(%40, %42, %41) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<64x64x1x1xf16>, tensor<64xf32>) -> tensor<1x64x160x160xf16> loc(#loc43)
    %44 = "tpu.Cast"(%43) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf16>) -> tensor<1x64x160x160xf32> loc(#loc44)
    %45 = "tpu.Active"(%44) {mode = #tpu<active_mode SILU>} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf32> loc(#loc45)
    %46 = "tpu.Cast"(%45) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x160x160xf32>) -> tensor<1x64x160x160xf16> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<128xf32> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<128x64x3x3xf16> loc(#loc48)
    %49 = "tpu.Conv2D"(%46, %48, %47) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160xf16>, tensor<128x64x3x3xf16>, tensor<128xf32>) -> tensor<1x128x80x80xf16> loc(#loc49)
    %50 = "tpu.Cast"(%49) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf16>) -> tensor<1x128x80x80xf32> loc(#loc50)
    %51 = "tpu.Active"(%50) {mode = #tpu<active_mode SILU>} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc51)
    %52 = "tpu.Cast"(%51) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf16> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<64xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<64x128x1x1xf16> loc(#loc54)
    %55 = "tpu.Conv2D"(%52, %54, %53) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80xf16>, tensor<64x128x1x1xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc55)
    %56 = "tpu.Cast"(%55) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc56)
    %57 = "tpu.Active"(%56) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc57)
    %58 = "tpu.Cast"(%57) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<64xf32> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<64x64x1x1xf16> loc(#loc60)
    %61 = "tpu.Conv2D"(%58, %60, %59) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80xf16>, tensor<64x64x1x1xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc61)
    %62 = "tpu.Cast"(%61) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc62)
    %63 = "tpu.Active"(%62) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc63)
    %64 = "tpu.Cast"(%63) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<64xf32> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<64x64x3x3xf16> loc(#loc66)
    %67 = "tpu.Conv2D"(%64, %66, %65) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80xf16>, tensor<64x64x3x3xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc67)
    %68 = "tpu.Cast"(%67) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc68)
    %69 = "tpu.Active"(%68) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc69)
    %70 = "tpu.Cast"(%69) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc70)
    %71 = "tpu.Add"(%58, %70) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf16>, tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf16> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<64xf32> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<64x64x1x1xf16> loc(#loc73)
    %74 = "tpu.Conv2D"(%71, %73, %72) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80xf16>, tensor<64x64x1x1xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc74)
    %75 = "tpu.Cast"(%74) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc75)
    %76 = "tpu.Active"(%75) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc76)
    %77 = "tpu.Cast"(%76) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<64xf32> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<64x64x3x3xf16> loc(#loc79)
    %80 = "tpu.Conv2D"(%77, %79, %78) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80xf16>, tensor<64x64x3x3xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc80)
    %81 = "tpu.Cast"(%80) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc81)
    %82 = "tpu.Active"(%81) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc82)
    %83 = "tpu.Cast"(%82) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc83)
    %84 = "tpu.Add"(%71, %83) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf16>, tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf16> loc(#loc84)
    %85 = "top.Weight"() : () -> tensor<64xf32> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<64x128x1x1xf16> loc(#loc86)
    %87 = "tpu.Conv2D"(%52, %86, %85) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80xf16>, tensor<64x128x1x1xf16>, tensor<64xf32>) -> tensor<1x64x80x80xf16> loc(#loc87)
    %88 = "tpu.Cast"(%87) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf16>) -> tensor<1x64x80x80xf32> loc(#loc88)
    %89 = "tpu.Active"(%88) {mode = #tpu<active_mode SILU>} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf32> loc(#loc89)
    %90 = "tpu.Cast"(%89) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x64x80x80xf32>) -> tensor<1x64x80x80xf16> loc(#loc90)
    %91 = "tpu.Concat"(%84, %90) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80xf16>, tensor<1x64x80x80xf16>) -> tensor<1x128x80x80xf16> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<128xf32> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<128x128x1x1xf16> loc(#loc93)
    %94 = "tpu.Conv2D"(%91, %93, %92) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80xf16>, tensor<128x128x1x1xf16>, tensor<128xf32>) -> tensor<1x128x80x80xf16> loc(#loc94)
    %95 = "tpu.Cast"(%94) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf16>) -> tensor<1x128x80x80xf32> loc(#loc95)
    %96 = "tpu.Active"(%95) {mode = #tpu<active_mode SILU>} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf32> loc(#loc96)
    %97 = "tpu.Cast"(%96) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x80x80xf32>) -> tensor<1x128x80x80xf16> loc(#loc97)
    %98 = "top.Weight"() : () -> tensor<256xf32> loc(#loc98)
    %99 = "top.Weight"() : () -> tensor<256x128x3x3xf16> loc(#loc99)
    %100 = "tpu.Conv2D"(%97, %99, %98) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80xf16>, tensor<256x128x3x3xf16>, tensor<256xf32>) -> tensor<1x256x40x40xf16> loc(#loc100)
    %101 = "tpu.Cast"(%100) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf16>) -> tensor<1x256x40x40xf32> loc(#loc101)
    %102 = "tpu.Active"(%101) {mode = #tpu<active_mode SILU>} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc102)
    %103 = "tpu.Cast"(%102) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf16> loc(#loc103)
    %104 = "top.Weight"() : () -> tensor<128xf32> loc(#loc104)
    %105 = "top.Weight"() : () -> tensor<128x256x1x1xf16> loc(#loc105)
    %106 = "tpu.Conv2D"(%103, %105, %104) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40xf16>, tensor<128x256x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc106)
    %107 = "tpu.Cast"(%106) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc107)
    %108 = "tpu.Active"(%107) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc108)
    %109 = "tpu.Cast"(%108) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc109)
    %110 = "top.Weight"() : () -> tensor<128xf32> loc(#loc110)
    %111 = "top.Weight"() : () -> tensor<128x128x1x1xf16> loc(#loc111)
    %112 = "tpu.Conv2D"(%109, %111, %110) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc112)
    %113 = "tpu.Cast"(%112) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc113)
    %114 = "tpu.Active"(%113) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc114)
    %115 = "tpu.Cast"(%114) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc115)
    %116 = "top.Weight"() : () -> tensor<128xf32> loc(#loc116)
    %117 = "top.Weight"() : () -> tensor<128x128x3x3xf16> loc(#loc117)
    %118 = "tpu.Conv2D"(%115, %117, %116) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x3x3xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc118)
    %119 = "tpu.Cast"(%118) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc119)
    %120 = "tpu.Active"(%119) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc120)
    %121 = "tpu.Cast"(%120) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc121)
    %122 = "tpu.Add"(%109, %121) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf16>, tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf16> loc(#loc122)
    %123 = "top.Weight"() : () -> tensor<128xf32> loc(#loc123)
    %124 = "top.Weight"() : () -> tensor<128x128x1x1xf16> loc(#loc124)
    %125 = "tpu.Conv2D"(%122, %124, %123) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc125)
    %126 = "tpu.Cast"(%125) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc126)
    %127 = "tpu.Active"(%126) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc127)
    %128 = "tpu.Cast"(%127) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc128)
    %129 = "top.Weight"() : () -> tensor<128xf32> loc(#loc129)
    %130 = "top.Weight"() : () -> tensor<128x128x3x3xf16> loc(#loc130)
    %131 = "tpu.Conv2D"(%128, %130, %129) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x3x3xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc131)
    %132 = "tpu.Cast"(%131) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc132)
    %133 = "tpu.Active"(%132) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc133)
    %134 = "tpu.Cast"(%133) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc134)
    %135 = "tpu.Add"(%122, %134) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf16>, tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf16> loc(#loc135)
    %136 = "top.Weight"() : () -> tensor<128xf32> loc(#loc136)
    %137 = "top.Weight"() : () -> tensor<128x128x1x1xf16> loc(#loc137)
    %138 = "tpu.Conv2D"(%135, %137, %136) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc138)
    %139 = "tpu.Cast"(%138) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc139)
    %140 = "tpu.Active"(%139) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc140)
    %141 = "tpu.Cast"(%140) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc141)
    %142 = "top.Weight"() : () -> tensor<128xf32> loc(#loc142)
    %143 = "top.Weight"() : () -> tensor<128x128x3x3xf16> loc(#loc143)
    %144 = "tpu.Conv2D"(%141, %143, %142) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x3x3xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc144)
    %145 = "tpu.Cast"(%144) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc145)
    %146 = "tpu.Active"(%145) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc146)
    %147 = "tpu.Cast"(%146) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc147)
    %148 = "tpu.Add"(%135, %147) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf16>, tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf16> loc(#loc148)
    %149 = "top.Weight"() : () -> tensor<128xf32> loc(#loc149)
    %150 = "top.Weight"() : () -> tensor<128x256x1x1xf16> loc(#loc150)
    %151 = "tpu.Conv2D"(%103, %150, %149) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40xf16>, tensor<128x256x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc151)
    %152 = "tpu.Cast"(%151) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc152)
    %153 = "tpu.Active"(%152) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc153)
    %154 = "tpu.Cast"(%153) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc154)
    %155 = "tpu.Concat"(%148, %154) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf16>, tensor<1x128x40x40xf16>) -> tensor<1x256x40x40xf16> loc(#loc155)
    %156 = "top.Weight"() : () -> tensor<256xf32> loc(#loc156)
    %157 = "top.Weight"() : () -> tensor<256x256x1x1xf16> loc(#loc157)
    %158 = "tpu.Conv2D"(%155, %157, %156) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40xf16>, tensor<256x256x1x1xf16>, tensor<256xf32>) -> tensor<1x256x40x40xf16> loc(#loc158)
    %159 = "tpu.Cast"(%158) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf16>) -> tensor<1x256x40x40xf32> loc(#loc159)
    %160 = "tpu.Active"(%159) {mode = #tpu<active_mode SILU>} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc160)
    %161 = "tpu.Cast"(%160) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf16> loc(#loc161)
    %162 = "top.Weight"() : () -> tensor<512xf32> loc(#loc162)
    %163 = "top.Weight"() : () -> tensor<512x256x3x3xf16> loc(#loc163)
    %164 = "tpu.Conv2D"(%161, %163, %162) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40xf16>, tensor<512x256x3x3xf16>, tensor<512xf32>) -> tensor<1x512x20x20xf16> loc(#loc164)
    %165 = "tpu.Cast"(%164) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf16>) -> tensor<1x512x20x20xf32> loc(#loc165)
    %166 = "tpu.Active"(%165) {mode = #tpu<active_mode SILU>} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc166)
    %167 = "tpu.Cast"(%166) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf16> loc(#loc167)
    %168 = "top.Weight"() : () -> tensor<256xf32> loc(#loc168)
    %169 = "top.Weight"() : () -> tensor<256x512x1x1xf16> loc(#loc169)
    %170 = "tpu.Conv2D"(%167, %169, %168) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x20x20xf16>, tensor<256x512x1x1xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc170)
    %171 = "tpu.Cast"(%170) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc171)
    %172 = "tpu.Active"(%171) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc172)
    %173 = "tpu.Cast"(%172) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc173)
    %174 = "top.Weight"() : () -> tensor<256xf32> loc(#loc174)
    %175 = "top.Weight"() : () -> tensor<256x256x1x1xf16> loc(#loc175)
    %176 = "tpu.Conv2D"(%173, %175, %174) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x20x20xf16>, tensor<256x256x1x1xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc176)
    %177 = "tpu.Cast"(%176) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc177)
    %178 = "tpu.Active"(%177) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc178)
    %179 = "tpu.Cast"(%178) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc179)
    %180 = "top.Weight"() : () -> tensor<256xf32> loc(#loc180)
    %181 = "top.Weight"() : () -> tensor<256x256x3x3xf16> loc(#loc181)
    %182 = "tpu.Conv2D"(%179, %181, %180) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x20x20xf16>, tensor<256x256x3x3xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc182)
    %183 = "tpu.Cast"(%182) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc183)
    %184 = "tpu.Active"(%183) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc184)
    %185 = "tpu.Cast"(%184) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc185)
    %186 = "tpu.Add"(%173, %185) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf16>, tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf16> loc(#loc186)
    %187 = "top.Weight"() : () -> tensor<256xf32> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<256x512x1x1xf16> loc(#loc188)
    %189 = "tpu.Conv2D"(%167, %188, %187) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x20x20xf16>, tensor<256x512x1x1xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc189)
    %190 = "tpu.Cast"(%189) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc190)
    %191 = "tpu.Active"(%190) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc191)
    %192 = "tpu.Cast"(%191) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc192)
    %193 = "tpu.Concat"(%186, %192) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf16>, tensor<1x256x20x20xf16>) -> tensor<1x512x20x20xf16> loc(#loc193)
    %194 = "top.Weight"() : () -> tensor<512xf32> loc(#loc194)
    %195 = "top.Weight"() : () -> tensor<512x512x1x1xf16> loc(#loc195)
    %196 = "tpu.Conv2D"(%193, %195, %194) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x20x20xf16>, tensor<512x512x1x1xf16>, tensor<512xf32>) -> tensor<1x512x20x20xf16> loc(#loc196)
    %197 = "tpu.Cast"(%196) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf16>) -> tensor<1x512x20x20xf32> loc(#loc197)
    %198 = "tpu.Active"(%197) {mode = #tpu<active_mode SILU>} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc198)
    %199 = "tpu.Cast"(%198) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf16> loc(#loc199)
    %200 = "top.Weight"() : () -> tensor<256xf32> loc(#loc200)
    %201 = "top.Weight"() : () -> tensor<256x512x1x1xf16> loc(#loc201)
    %202 = "tpu.Conv2D"(%199, %201, %200) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x20x20xf16>, tensor<256x512x1x1xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc202)
    %203 = "tpu.Cast"(%202) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc203)
    %204 = "tpu.Active"(%203) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc204)
    %205 = "tpu.Cast"(%204) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc205)
    %206 = "tpu.Pool2D"(%205) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf16> loc(#loc206)
    %207 = "tpu.Pool2D"(%206) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf16> loc(#loc207)
    %208 = "tpu.Pool2D"(%207) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf16> loc(#loc208)
    %209 = "tpu.Concat"(%205, %206, %207, %208) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x20x20xf16>, tensor<1x256x20x20xf16>, tensor<1x256x20x20xf16>, tensor<1x256x20x20xf16>) -> tensor<1x1024x20x20xf16> loc(#loc209)
    %210 = "top.Weight"() : () -> tensor<512xf32> loc(#loc210)
    %211 = "top.Weight"() : () -> tensor<512x1024x1x1xf16> loc(#loc211)
    %212 = "tpu.Conv2D"(%209, %211, %210) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x1024x20x20xf16>, tensor<512x1024x1x1xf16>, tensor<512xf32>) -> tensor<1x512x20x20xf16> loc(#loc212)
    %213 = "tpu.Cast"(%212) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf16>) -> tensor<1x512x20x20xf32> loc(#loc213)
    %214 = "tpu.Active"(%213) {mode = #tpu<active_mode SILU>} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf32> loc(#loc214)
    %215 = "tpu.Cast"(%214) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x512x20x20xf32>) -> tensor<1x512x20x20xf16> loc(#loc215)
    %216 = "top.Weight"() : () -> tensor<256xf32> loc(#loc216)
    %217 = "top.Weight"() : () -> tensor<256x512x1x1xf16> loc(#loc217)
    %218 = "tpu.Conv2D"(%215, %217, %216) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x20x20xf16>, tensor<256x512x1x1xf16>, tensor<256xf32>) -> tensor<1x256x20x20xf16> loc(#loc218)
    %219 = "tpu.Cast"(%218) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf16>) -> tensor<1x256x20x20xf32> loc(#loc219)
    %220 = "tpu.Active"(%219) {mode = #tpu<active_mode SILU>} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf32> loc(#loc220)
    %221 = "tpu.Cast"(%220) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x20x20xf32>) -> tensor<1x256x20x20xf16> loc(#loc221)
    %222 = "tpu.Upsample"(%221) {do_relu = false, relu_limit = -1.000000e+00 : f64, scale_h = 2 : i64, scale_w = 2 : i64} : (tensor<1x256x20x20xf16>) -> tensor<1x256x40x40xf16> loc(#loc222)
    %223 = "tpu.Concat"(%222, %161) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x40x40xf16>, tensor<1x256x40x40xf16>) -> tensor<1x512x40x40xf16> loc(#loc223)
    %224 = "top.Weight"() : () -> tensor<128xf32> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<128x512x1x1xf16> loc(#loc225)
    %226 = "tpu.Conv2D"(%223, %225, %224) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x40x40xf16>, tensor<128x512x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc226)
    %227 = "tpu.Cast"(%226) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc227)
    %228 = "tpu.Active"(%227) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc228)
    %229 = "tpu.Cast"(%228) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc229)
    %230 = "top.Weight"() : () -> tensor<128xf32> loc(#loc230)
    %231 = "top.Weight"() : () -> tensor<128x128x1x1xf16> loc(#loc231)
    %232 = "tpu.Conv2D"(%229, %231, %230) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc232)
    %233 = "tpu.Cast"(%232) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc233)
    %234 = "tpu.Active"(%233) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc234)
    %235 = "tpu.Cast"(%234) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc235)
    %236 = "top.Weight"() : () -> tensor<128xf32> loc(#loc236)
    %237 = "top.Weight"() : () -> tensor<128x128x3x3xf16> loc(#loc237)
    %238 = "tpu.Conv2D"(%235, %237, %236) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40xf16>, tensor<128x128x3x3xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc238)
    %239 = "tpu.Cast"(%238) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc239)
    %240 = "tpu.Active"(%239) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc240)
    %241 = "tpu.Cast"(%240) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc241)
    %242 = "top.Weight"() : () -> tensor<128xf32> loc(#loc242)
    %243 = "top.Weight"() : () -> tensor<128x512x1x1xf16> loc(#loc243)
    %244 = "tpu.Conv2D"(%223, %243, %242) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x40x40xf16>, tensor<128x512x1x1xf16>, tensor<128xf32>) -> tensor<1x128x40x40xf16> loc(#loc244)
    %245 = "tpu.Cast"(%244) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf16>) -> tensor<1x128x40x40xf32> loc(#loc245)
    %246 = "tpu.Active"(%245) {mode = #tpu<active_mode SILU>} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf32> loc(#loc246)
    %247 = "tpu.Cast"(%246) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x128x40x40xf32>) -> tensor<1x128x40x40xf16> loc(#loc247)
    %248 = "tpu.Concat"(%241, %247) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x40x40xf16>, tensor<1x128x40x40xf16>) -> tensor<1x256x40x40xf16> loc(#loc248)
    %249 = "top.Weight"() : () -> tensor<256xf32> loc(#loc249)
    %250 = "top.Weight"() : () -> tensor<256x256x1x1xf16> loc(#loc250)
    %251 = "tpu.Conv2D"(%248, %250, %249) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40xf16>, tensor<256x256x1x1xf16>, tensor<256xf32>) -> tensor<1x256x40x40xf16> loc(#loc251)
    %252 = "tpu.Cast"(%251) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf16>) -> tensor<1x256x40x40xf32> loc(#loc252)
    %253 = "tpu.Active"(%252) {mode = #tpu<active_mode SILU>} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf32> loc(#loc253)
    %254 = "tpu.Cast"(%253) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x256x40x40xf32>) -> tensor<1x256x40x40xf16> loc(#loc254)
