#loc = loc(unknown)
module @yolov5s attributes {module.FLOPs = 16683511600 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "INT8", module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "yolov5s_tpu_lowered_bm1684x_int8_sym_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x3x80x80x85xf32>, tensor<1x3x40x40x85xf32>, tensor<1x3x20x20x85xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039216000586748123, 0.0039216000586748123, 0.0039216000586748123]} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>>) -> tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32x3x6x6xsi8> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc4)
    %5 = "tpu.Conv2D"(%2, %3, %4) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [6, 6], kernel_zp = 0 : i64, multiplier = [1401461, 111279, 335529, 632643, 577293, 632001, 234237, 481711, 292625, 934503, 547663, 728157, 2310653, 709235, 52631, 1188897, 346715, 194797, 1332955, 167525, 307325, 108081, 1694305, 1825765, 284057, 1317215, 176561, 113565, 677, 2897739, 148925, 302939], pads = [2, 2, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 30, 28, 28, 30, 30, 29, 30, 29, 30, 30, 30, 30, 29, 29, 29, 28, 29, 30, 30, 29, 29, 30, 30, 30, 29, 27, 30, 20, 30, 30, 30], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>>, tensor<32x3x6x6xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.32595742834645669>> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc6)
    %7 = "tpu.Lut"(%5, %6) : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.32595742834645669>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.29535947637795273>> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<64x32x3x3xsi8> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc9)
    %10 = "tpu.Conv2D"(%7, %8, %9) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [3435049, 1323885, 541849, 926329, 3664693, 1813231, 668019, 2832495, 2740845, 151199, 2374721, 3065225, 1126231, 1090651, 1399629, 1615925, 105293, 3947793, 740451, 726701, 77401, 3325823, 1101383, 1870299, 2388221, 7165131, 161625, 394487, 511179, 4891495, 1203327, 2956125, 2078309, 3638103, 1036949, 3275233, 2732601, 672353, 3397261, 1552639, 3478565, 244007, 3148233, 804411, 678673, 1317115, 2040985, 2452449, 6415175, 1157305, 3986175, 1312817, 1254247, 1921359, 2083541, 962909, 5801459, 131719, 131439, 446215, 297105, 433143, 4346061, 543601], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 29, 29, 29, 30, 29, 28, 29, 30, 25, 30, 30, 28, 29, 29, 30, 26, 30, 28, 28, 26, 29, 28, 30, 30, 30, 26, 28, 27, 30, 29, 29, 30, 30, 29, 30, 30, 28, 30, 28, 30, 26, 30, 29, 29, 29, 29, 29, 30, 28, 30, 29, 29, 30, 30, 28, 30, 26, 25, 28, 27, 28, 30, 27], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.29535947637795273>>, tensor<64x32x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.37150840629921261>> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc11)
    %12 = "tpu.Lut"(%10, %11) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.37150840629921261>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<32x64x1x1xsi8> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc14)
    %15 = "tpu.Conv2D"(%12, %13, %14) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [7405941, 1638513, 768067, 1630477, 129857, 1873793, 427263, 107015, 1547683, 160929, 1078489, 33775, 1194699, 222729, 8333, 232385, 558291, 481853, 653169, 1678327, 1186205, 658801, 102079, 397685, 204559, 1514799, 612435, 1276473, 480625, 980283, 2304429, 10946247], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 30, 29, 30, 27, 30, 28, 26, 30, 27, 30, 26, 28, 30, 23, 28, 30, 30, 29, 30, 29, 29, 26, 26, 28, 30, 30, 29, 30, 29, 30, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>>, tensor<32x64x1x1xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.24746363149606301>> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc16)
    %17 = "tpu.Lut"(%15, %16) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.24746363149606301>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<32x32x1x1xsi8> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc19)
    %20 = "tpu.Conv2D"(%17, %18, %19) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1638167, 6314329, 7048993, 2833525, 13379867, 3297281, 2132957, 10898395, 13503263, 3856491, 5740283, 3411319, 6689605, 9623859, 2500515, 950069, 8557205, 4759713, 427033, 2769689, 7610747, 4983657, 5039227, 5178801, 6833257, 4292625, 2490819, 597367, 13423733, 16194945, 3296963, 7720799], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [28, 29, 30, 29, 30, 29, 28, 30, 30, 29, 30, 29, 29, 30, 28, 27, 30, 29, 26, 29, 30, 29, 30, 28, 29, 29, 28, 26, 30, 30, 29, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>>, tensor<32x32x1x1xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.11114269842519685>> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc21)
    %22 = "tpu.Lut"(%20, %21) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.11114269842519685>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.10140994409448818>> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<32x32x3x3xsi8> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc24)
    %25 = "tpu.Conv2D"(%22, %23, %24) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [2227053, 4330611, 1538773, 2233737, 3479797, 893125, 51831, 3446015, 869393, 1209581, 403589, 764825, 894101, 958499, 1573505, 1092417, 2851531, 84199, 3854599, 1223779, 2767, 3178897, 3763231, 4158213, 421433, 1131783, 1476103, 1897341, 552301, 253169, 1565553, 4121833], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [29, 29, 29, 30, 29, 28, 23, 29, 28, 28, 27, 28, 27, 28, 28, 29, 30, 25, 30, 28, 21, 29, 30, 30, 28, 28, 29, 29, 27, 28, 29, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.10140994409448818>>, tensor<32x32x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.095083035433070867>> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc26)
    %27 = "tpu.Lut"(%25, %26) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.095083035433070867>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.088719262204724411>> loc(#loc27)
    %28 = "tpu.Add"(%17, %27) {do_relu = false, multipliers = [69, 47], relu_limit = -1.000000e+00 : f64, rshifts = [8, 6]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.088719262204724411>>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc28)
    %29 = "top.Weight"() : () -> tensor<32x64x1x1xsi8> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc30)
    %31 = "tpu.Conv2D"(%12, %29, %30) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [2230097, 14037685, 6206699, 1457539, 3850859, 6223339, 1648001, 8811371, 2572753, 2223525, 9710117, 680455, 1549363, 2099811, 427095, 751495, 6572121, 9426495, 1678447, 1282739, 5131779, 10536079, 3529995, 1126265, 5570825, 3279881, 2427181, 10922237, 1493893, 6180985, 1441325, 702509], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 30, 30, 28, 29, 30, 27, 30, 29, 29, 30, 28, 28, 29, 27, 28, 29, 30, 29, 28, 29, 30, 29, 28, 30, 29, 29, 30, 28, 29, 29, 25], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>>, tensor<32x64x1x1xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.13293712362204724>> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc32)
    %33 = "tpu.Lut"(%31, %32) : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.13293712362204724>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc33)
    %34 = "tpu.Concat"(%28, %33) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<64x64x1x1xsi8> loc(#loc35)
    %36 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc36)
    %37 = "tpu.Conv2D"(%34, %35, %36) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [7458489, 22417, 1657337, 2161713, 2758165, 9247995, 1975019, 2130777, 3470459, 884631, 1552193, 2732415, 2024491, 2086767, 3169129, 100659, 1212335, 3926993, 395197, 737935, 13505133, 5430155, 1285859, 8986197, 185301, 1966653, 3338471, 10934211, 583005, 247755, 3228635, 3432997, 2647643, 3327033, 5270493, 2810531, 2937605, 3488505, 3927847, 2744837, 1524737, 2061063, 553843, 1801465, 1885083, 2616403, 453071, 453271, 688825, 3175951, 8853569, 12761295, 5483301, 2253643, 853443, 2852291, 1822131, 520155, 3145589, 6031631, 5335649, 2625147, 815903, 1215101], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 22, 28, 29, 29, 30, 29, 29, 29, 28, 28, 29, 28, 28, 30, 24, 28, 29, 27, 27, 30, 30, 28, 30, 25, 28, 30, 30, 27, 25, 29, 29, 29, 29, 30, 29, 29, 29, 30, 29, 28, 28, 27, 28, 28, 29, 27, 27, 27, 29, 30, 30, 30, 29, 27, 29, 28, 27, 29, 30, 30, 29, 27, 28], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>, tensor<64x64x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.079613174015748023>> loc(#loc37)
    %38 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc38)
    %39 = "tpu.Lut"(%37, %38) : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.079613174015748023>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.08493915826771653>> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<128x64x3x3xsi8> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc41)
    %42 = "tpu.Conv2D"(%39, %40, %41) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [433867, 140011, 255823, 3093313, 41713, 2292653, 2374045, 2991595, 2840637, 1986379, 62281, 1288117, 2257483, 502859, 1312459, 2769491, 2511793, 159497, 684055, 1082425, 1037501, 859293, 808239, 1819059, 2000211, 1116757, 2062091, 652527, 2385999, 291319, 1363351, 528557, 214407, 374017, 363103, 1564661, 1319599, 3653977, 17473, 1327613, 1636681, 686729, 76223, 718055, 616351, 517285, 2717739, 279473, 2735905, 1360851, 1267303, 3015887, 680777, 3291603, 950659, 3149367, 1047677, 1507467, 2312921, 694449, 809145, 1129031, 1074719, 2134847, 129275, 1528961, 1734533, 3015761, 135551, 1190949, 1769771, 1258147, 354067, 901303, 1877183, 1122685, 1879603, 508127, 1624963, 3036395, 2604909, 146133, 1469293, 1459267, 3753763, 2031793, 1506217, 435173, 556699, 1080623, 1059797, 25919, 1188523, 782521, 410677, 738657, 1060081, 734551, 3166427, 729181, 1076647, 1894405, 696113, 2309909, 384439, 3002261, 500507, 2324337, 231793, 547741, 3135811, 2435927, 2046277, 1575435, 3225277, 1081455, 1013765, 1402727, 965145, 1000351, 173289, 272483, 831475, 266679, 608411, 1089507, 1136475, 698799], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [27, 26, 28, 30, 25, 30, 30, 30, 30, 30, 26, 30, 30, 29, 29, 30, 30, 26, 28, 29, 29, 29, 28, 29, 30, 29, 30, 29, 30, 28, 29, 28, 27, 27, 28, 29, 30, 30, 23, 30, 29, 29, 26, 28, 28, 28, 30, 27, 30, 29, 29, 30, 28, 30, 29, 30, 29, 29, 30, 29, 29, 29, 29, 30, 26, 29, 30, 30, 27, 29, 30, 29, 28, 29, 30, 29, 30, 28, 30, 30, 30, 27, 29, 30, 30, 30, 30, 28, 29, 30, 29, 25, 29, 28, 28, 28, 29, 29, 30, 28, 30, 30, 29, 30, 29, 30, 27, 30, 27, 29, 30, 30, 30, 30, 30, 29, 29, 30, 29, 30, 26, 27, 28, 27, 28, 29, 30, 29], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.08493915826771653>>, tensor<128x64x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc43)
    %44 = "tpu.Lut"(%42, %43) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.039389724409448816>> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<64x128x1x1xsi8> loc(#loc45)
    %46 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc46)
    %47 = "tpu.Conv2D"(%44, %45, %46) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1343207, 170223, 912537, 3211529, 931873, 1579177, 637343, 2309161, 3875869, 1494871, 3647237, 1825917, 2143763, 310149, 2547993, 549517, 2285405, 1004399, 2259543, 3395193, 1562249, 3172173, 479797, 3257895, 2678699, 2961895, 1895171, 1787597, 1720747, 2116059, 869297, 493977, 1614555, 374157, 3616021, 2388559, 6359313, 4193171, 458989, 1120741, 1590593, 839143, 912195, 4337183, 756965, 3546863, 736059, 3360943, 112153, 1186767, 267765, 1474131, 3685003, 2376315, 5663919, 2581177, 4672535, 769099, 4109805, 1702807, 613753, 2118811, 1881077, 1245303], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [29, 27, 29, 29, 28, 30, 28, 30, 30, 30, 30, 30, 30, 27, 30, 28, 30, 29, 29, 30, 30, 29, 27, 30, 30, 30, 29, 30, 30, 30, 28, 28, 29, 27, 30, 29, 30, 30, 27, 29, 30, 29, 29, 30, 29, 30, 29, 30, 26, 28, 27, 29, 30, 30, 30, 30, 30, 29, 30, 29, 28, 29, 30, 29], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.039389724409448816>>, tensor<64x128x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024539233858267718>> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc48)
    %49 = "tpu.Lut"(%47, %48) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024539233858267718>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<64x64x1x1xsi8> loc(#loc50)
    %51 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc51)
    %52 = "tpu.Conv2D"(%49, %50, %51) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [2222351, 3440231, 2269793, 1864083, 1907453, 758153, 332223, 3202729, 1160955, 280911, 1814317, 3599681, 2899473, 394881, 3229775, 2294797, 3638265, 969603, 1747677, 4666675, 877159, 2816767, 2984711, 250075, 2956445, 1866559, 430717, 1193067, 2475215, 3052143, 2965987, 109811, 2058871, 196371, 392697, 4488737, 907375, 2521991, 2022853, 2869443, 964131, 3225539, 4709459, 3621929, 5599265, 824289, 2744527, 2585985, 50005, 4363661, 879567, 1186049, 4661977, 880979, 2370037, 917043, 3609311, 4753363, 4008067, 1083653, 3829327, 996727, 234077, 3786079], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [29, 30, 29, 29, 29, 28, 26, 30, 28, 26, 29, 30, 30, 27, 29, 29, 30, 28, 29, 30, 28, 30, 29, 26, 29, 29, 27, 28, 29, 30, 30, 25, 29, 27, 27, 30, 28, 29, 29, 30, 28, 30, 30, 30, 30, 28, 30, 29, 24, 30, 28, 28, 30, 28, 29, 28, 30, 30, 30, 28, 30, 28, 26, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>>, tensor<64x64x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.043872662204724411>> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc53)
    %54 = "tpu.Lut"(%52, %53) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.043872662204724411>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047696196062992122>> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc56)
    %57 = "tpu.Conv2D"(%54, %55, %56) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [2282615, 1472193, 574435, 22921, 1349929, 272877, 1154115, 1839707, 383801, 2493229, 1565697, 1978847, 17265, 1112103, 766769, 359825, 62057, 252207, 1230447, 2726285, 1445259, 729715, 1516071, 1137021, 828723, 917323, 126069, 1297623, 2022581, 576119, 2455887, 487773, 1037445, 538433, 87713, 2878827, 1432559, 872035, 383001, 1594407, 561683, 3115431, 545585, 2188731, 1527779, 2385835, 1909727, 1311939, 557097, 884223, 1776417, 963935, 703473, 2889661, 2074447, 3211285, 3565955, 2599151, 2231095, 373219, 515121, 1137865, 691039, 603313], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 29, 28, 24, 29, 27, 30, 29, 27, 30, 30, 30, 23, 30, 29, 28, 25, 27, 29, 30, 29, 28, 29, 29, 29, 29, 26, 29, 30, 28, 30, 28, 29, 29, 25, 30, 28, 29, 27, 29, 28, 30, 28, 30, 29, 30, 29, 29, 28, 29, 30, 29, 28, 30, 30, 30, 30, 30, 30, 28, 28, 29, 29, 29], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047696196062992122>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.03659276535433071>> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc58)
    %59 = "tpu.Lut"(%57, %58) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.03659276535433071>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.021455972440944885>> loc(#loc59)
    %60 = "tpu.Add"(%49, %59) {do_relu = false, multipliers = [59, 113], relu_limit = -1.000000e+00 : f64, rshifts = [7, 7]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.021455972440944885>>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024273014960629922>> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<64x64x1x1xsi8> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc62)
    %63 = "tpu.Conv2D"(%60, %61, %62) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [749415, 2269783, 2809851, 2662785, 1328135, 4267961, 3270823, 2032077, 1167355, 1402977, 5725359, 1193369, 901309, 3796171, 3028599, 8509999, 1871073, 1191763, 107563, 1882613, 561635, 2244925, 370409, 1394347, 1345201, 1637521, 2075069, 2786213, 198407, 1425533, 4111347, 302251, 4962761, 3584147, 592205, 4236643, 921435, 1085707, 3491517, 3662203, 3492377, 3142475, 625089, 3077455, 1291889, 1528851, 1473913, 12057, 2474439, 3124905, 629605, 2249251, 6038411, 4146415, 1021003, 1794755, 2156575, 3958287, 12691315, 1125623, 4129833, 4592407, 4718209, 1454067], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [27, 29, 29, 29, 28, 30, 30, 29, 28, 29, 30, 28, 27, 30, 30, 30, 29, 28, 25, 28, 27, 29, 27, 28, 29, 28, 29, 29, 26, 29, 29, 26, 30, 30, 28, 30, 28, 28, 29, 30, 29, 30, 27, 30, 28, 28, 28, 21, 29, 30, 29, 29, 30, 30, 28, 29, 29, 30, 30, 28, 30, 30, 30, 28], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024273014960629922>>, tensor<64x64x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.041986418110236221>> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc64)
    %65 = "tpu.Lut"(%63, %64) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.041986418110236221>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047403425984251971>> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc67)
    %68 = "tpu.Conv2D"(%65, %66, %67) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [517399, 649753, 2051997, 2817559, 3023497, 3562361, 926609, 879863, 567119, 24393, 1812525, 19377, 1467797, 3216641, 3971219, 576115, 1094241, 1866219, 1900725, 2066423, 4278729, 2111333, 2175815, 2835689, 4749787, 2751751, 2560943, 2399733, 2028565, 2917601, 467355, 3103223, 1234245, 916649, 1323409, 1480901, 1182285, 594677, 2278907, 1828951, 338167, 265427, 3853713, 3927029, 98447, 444733, 1161079, 205101, 3311989, 1372413, 599955, 783527, 2254357, 1935735, 1641919, 2062127, 11349, 1893923, 1445485, 831603, 633881, 3620133, 1749125, 533753], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [26, 28, 30, 30, 30, 30, 29, 28, 27, 23, 30, 23, 29, 30, 30, 28, 29, 29, 29, 29, 29, 29, 29, 30, 30, 30, 30, 30, 30, 30, 27, 30, 29, 28, 28, 29, 28, 28, 29, 29, 27, 27, 30, 30, 25, 27, 29, 26, 30, 29, 28, 28, 30, 29, 29, 30, 22, 30, 29, 28, 28, 30, 29, 28], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047403425984251971>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048311879527559054>> loc(#loc68)
    %69 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc69)
    %70 = "tpu.Lut"(%68, %69) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048311879527559054>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.039847262204724412>> loc(#loc70)
    %71 = "tpu.Add"(%60, %70) {do_relu = false, multipliers = [1, 105], relu_limit = -1.000000e+00 : f64, rshifts = [1, 7]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024273014960629922>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.039847262204724412>>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048706242519685042>> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<64x128x1x1xsi8> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc73)
    %74 = "tpu.Conv2D"(%44, %72, %73) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [203717, 2421131, 7324931, 436137, 3434213, 4197725, 5086925, 7101929, 8978273, 1909623, 466495, 11191017, 4194717, 3531641, 8572965, 1619329, 3033473, 1023535, 4023697, 681249, 5170953, 3505629, 1137849, 10659811, 3931403, 962961, 673437, 2292813, 6003025, 9657195, 1936349, 2256205, 5409171, 1852265, 3949553, 1406825, 10194695, 2785205, 7657415, 4183643, 2786969, 109017, 5319643, 5813197, 1529221, 2750061, 949911, 2537727, 444853, 4310761, 2763987, 4047207, 696827, 5571935, 10964645, 4726059, 281157, 356523, 8131823, 13907587, 5523541, 2959203, 804787, 801991], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [25, 29, 30, 27, 29, 28, 30, 29, 30, 28, 26, 30, 29, 30, 30, 28, 29, 28, 29, 27, 30, 29, 28, 30, 30, 28, 28, 29, 29, 30, 28, 29, 30, 29, 29, 27, 30, 29, 30, 29, 28, 25, 30, 30, 28, 29, 27, 29, 26, 29, 29, 30, 27, 30, 30, 29, 25, 26, 30, 30, 30, 29, 27, 27], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.039389724409448816>>, tensor<64x128x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.038964575590551179>> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc75)
    %76 = "tpu.Lut"(%74, %75) : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.038964575590551179>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048706242519685042>> loc(#loc76)
    %77 = "tpu.Concat"(%71, %76) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048706242519685042>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.048706242519685042>>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.048706242519685042>> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc79)
    %80 = "tpu.Conv2D"(%77, %78, %79) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1915199, 4132881, 2139999, 498811, 1231085, 3609885, 2691581, 1598379, 1372605, 1702105, 1167679, 1101281, 546713, 803739, 2606281, 321947, 3809097, 918061, 1884205, 4998465, 78889, 1900821, 406543, 3767171, 839967, 2124747, 3018819, 3919853, 2446791, 1783425, 2598483, 4303287, 2804669, 1432799, 1602955, 1890219, 1492993, 3369621, 2991479, 1530863, 212129, 2577129, 562267, 637713, 1532177, 2901923, 1188709, 337993, 3868585, 575439, 1543519, 31867, 1532951, 985605, 835301, 1882827, 3072895, 1343531, 2580119, 76771, 1984353, 861881, 660643, 3122979, 2408171, 283493, 1723901, 2255981, 4033679, 122605, 1860423, 671611, 656819, 222033, 2745409, 2447041, 3149907, 3114873, 2420853, 3880799, 4350269, 851851, 568425, 3070183, 2576305, 416549, 1432933, 1475247, 6568111, 1577157, 553103, 1514571, 2771763, 1513463, 787775, 100167, 1670375, 1465955, 1169089, 3182609, 1182893, 3907345, 3568299, 966535, 2960411, 653511, 2988809, 1153143, 1559153, 12171, 2927697, 1035677, 2636523, 2843043, 1081803, 2412101, 3014313, 3888083, 977869, 44963, 3837347, 2277987, 2153, 2085947, 1899317, 1313273, 1108595, 714279], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [29, 29, 29, 28, 29, 30, 29, 30, 29, 28, 28, 28, 27, 28, 30, 27, 30, 28, 29, 30, 25, 29, 27, 30, 29, 29, 29, 30, 30, 28, 29, 30, 30, 29, 28, 30, 28, 29, 30, 29, 26, 29, 27, 27, 29, 30, 28, 27, 30, 27, 29, 23, 29, 29, 28, 29, 29, 29, 29, 25, 29, 29, 27, 30, 29, 26, 30, 29, 30, 25, 29, 28, 28, 27, 29, 29, 30, 30, 30, 30, 30, 28, 27, 30, 29, 27, 29, 29, 30, 29, 27, 29, 30, 29, 28, 24, 30, 29, 28, 30, 28, 30, 30, 28, 30, 28, 30, 29, 28, 22, 30, 28, 29, 30, 29, 30, 30, 29, 28, 24, 30, 30, 19, 29, 29, 29, 28, 28], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.048706242519685042>>, tensor<128x128x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.03965484409448819>> loc(#loc80)
    %81 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc81)
    %82 = "tpu.Lut"(%80, %81) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.03965484409448819>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.030274422834645671>> loc(#loc82)
    %83 = "top.Weight"() : () -> tensor<256x128x3x3xsi8> loc(#loc83)
    %84 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc84)
    %85 = "tpu.Conv2D"(%82, %83, %84) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1122201, 236233, 7251, 555917, 502473, 783783, 1280789, 78705, 550875, 467285, 583515, 301617, 435199, 36385, 320985, 12271, 1024531, 197359, 41051, 1594249, 850165, 1022735, 13013, 411825, 1321575, 1188629, 930637, 311491, 1348411, 812751, 911151, 1286983, 259869, 278077, 23647, 131265, 269587, 257945, 580775, 1085167, 47727, 674209, 202529, 304087, 412739, 928635, 135783, 545417, 2013853, 1261421, 418851, 1231407, 195205, 1791607, 1211341, 254167, 84167, 858323, 808037, 799555, 2592473, 722869, 1212027, 49891, 111655, 1021673, 796549, 609759, 622505, 89195, 1179641, 587531, 589509, 244135, 1268681, 200547, 1101387, 86523, 1839847, 962467, 124407, 1221395, 229883, 500377, 369927, 630155, 53927, 352901, 769169, 386289, 217415, 166663, 119137, 1581833, 473323, 531523, 444567, 881503, 221927, 669557, 924581, 220069, 1886913, 95707, 465429, 411781, 173163, 784315, 67235, 1150371, 787353, 562695, 54381, 1393605, 1092445, 342241, 655497, 1162427, 1139609, 860079, 857765, 831421, 379539, 1184895, 707145, 55057, 750039, 134809, 669837, 1421415, 788997, 542803, 130693, 455313, 534479, 1591497, 90191, 568593, 2305443, 234011, 645767, 42865, 543451, 56623, 390113, 360455, 1322581, 1145067, 421, 164115, 62911, 576505, 755347, 302171, 491745, 108215, 750855, 546021, 1244343, 367059, 171301, 750045, 856205, 549677, 394321, 1074083, 678343, 708851, 156877, 428419, 989167, 337897, 247173, 1293197, 1555967, 1002505, 1292531, 1593599, 1061199, 862439, 313271, 564381, 706489, 263039, 124195, 1236841, 723727, 403603, 948951, 309139, 522163, 489493, 672381, 515001, 486801, 702535, 915507, 61823, 600405, 1395869, 778185, 1040429, 782025, 2579419, 400481, 136835, 716253, 1038431, 592531, 143825, 58841, 279071, 248557, 840547, 804225, 595541, 1130119, 125247, 1171635, 646293, 797243, 697165, 360319, 147935, 1255255, 1325703, 1667765, 820433, 236885, 517497, 74929, 1262729, 463599, 962519, 749629, 778039, 767473, 525773, 495583, 1003149, 167209, 389847, 80335, 1065657, 536369, 273231, 2289983, 159821, 671065, 714311, 674121, 896417, 1730953, 358645, 86933, 39845], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 28, 23, 29, 28, 30, 30, 27, 30, 29, 29, 29, 28, 26, 28, 24, 30, 28, 26, 30, 29, 30, 24, 28, 30, 30, 30, 29, 30, 29, 30, 30, 28, 28, 24, 27, 28, 29, 29, 30, 26, 30, 28, 29, 29, 30, 28, 29, 30, 30, 29, 30, 28, 30, 30, 28, 27, 30, 30, 30, 30, 30, 30, 25, 26, 30, 30, 29, 30, 26, 30, 29, 29, 28, 30, 28, 30, 26, 30, 30, 27, 30, 27, 29, 29, 30, 26, 28, 30, 28, 28, 28, 27, 30, 29, 29, 28, 30, 28, 30, 30, 29, 30, 27, 29, 29, 27, 30, 26, 30, 30, 29, 26, 30, 30, 29, 29, 30, 30, 30, 30, 30, 29, 30, 28, 26, 30, 27, 30, 30, 30, 29, 27, 29, 29, 30, 27, 30, 30, 28, 29, 25, 29, 26, 28, 29, 30, 30, 19, 27, 26, 29, 30, 28, 28, 27, 30, 29, 30, 29, 28, 30, 29, 29, 29, 30, 30, 30, 28, 29, 30, 29, 28, 30, 30, 30, 30, 30, 30, 30, 29, 29, 28, 28, 27, 30, 29, 29, 30, 28, 29, 29, 30, 29, 28, 30, 30, 26, 30, 30, 30, 30, 29, 30, 29, 28, 29, 30, 30, 27, 26, 28, 29, 30, 30, 29, 29, 28, 30, 28, 30, 29, 29, 27, 30, 30, 30, 30, 28, 29, 26, 30, 29, 30, 30, 30, 30, 29, 29, 30, 27, 29, 26, 30, 30, 28, 30, 27, 30, 29, 29, 30, 30, 29, 27, 26], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.030274422834645671>>, tensor<256x128x3x3xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.063787422834645668>> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc86)
    %87 = "tpu.Lut"(%85, %86) : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.063787422834645668>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x40x40x!quant.uniform<i8:f32, 0.033977317322834648>> loc(#loc87)
    %88 = "top.Weight"() : () -> tensor<128x256x1x1xsi8> loc(#loc88)
    %89 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc89)
    %90 = "tpu.Conv2D"(%87, %88, %89) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [16831, 1145703, 533169, 999509, 1146909, 1454389, 990097, 1756321, 18789, 436579, 3314653, 1116399, 939963, 3399173, 242343, 738265, 1478257, 637661, 2551837, 1975673, 1255849, 468111, 3160127, 110835, 554085, 616333, 696975, 751069, 1298325, 1803573, 690113, 1732545, 601489, 421873, 1166379, 15665, 535447, 651705, 411421, 123015, 756091, 17141, 1785839, 341519, 2550939, 27933, 717497, 962159, 1270243, 1424741, 14237, 552753, 1470425, 69305, 1500267, 391279, 1595673, 375427, 1167071, 436507, 1926219, 433005, 1116005, 1230421, 147849, 59397, 1115727, 1780855, 314979, 1751467, 339829, 680445, 2397707, 385015, 224569, 1102725, 155133, 2457581, 2002639, 339701, 871915, 401549, 1733703, 290101, 381531, 974761, 6979667, 314285, 589017, 3661551, 584315, 2176263, 844393, 1110921, 2783407, 1319869, 330811, 1051195, 1086543, 5414697, 203697, 1257803, 1426999, 1807487, 498481, 122991, 1049143, 2473895, 1762177, 525983, 550079, 572965, 378721, 735245, 1914427, 2507501, 1204783, 568655, 1184399, 456407, 2141041, 4175983, 818275, 1344073, 275763, 876219, 1041677, 1430685], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [23, 29, 29, 29, 30, 29, 30, 30, 24, 29, 30, 29, 30, 30, 27, 29, 30, 28, 30, 30, 30, 29, 30, 26, 28, 29, 29, 29, 29, 29, 28, 30, 29, 28, 30, 23, 28, 29, 28, 25, 29, 23, 30, 27, 30, 24, 29, 29, 30, 30, 23, 29, 30, 25, 30, 28, 30, 28, 29, 29, 30, 28, 30, 30, 27, 25, 30, 30, 28, 30, 27, 29, 30, 28, 28, 30, 27, 30, 30, 28, 29, 28, 30, 27, 28, 28, 29, 28, 28, 30, 29, 30, 29, 29, 30, 30, 28, 30, 29, 30, 27, 29, 30, 30, 29, 26, 29, 30, 30, 29, 29, 29, 27, 29, 30, 30, 30, 29, 30, 29, 30, 30, 29, 30, 27, 29, 29, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x40x40x!quant.uniform<i8:f32, 0.033977317322834648>>, tensor<128x256x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.030121476377952757>> loc(#loc90)
    %91 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc91)
    %92 = "tpu.Lut"(%90, %91) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.030121476377952757>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.014900897637795276>> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc93)
    %94 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc94)
    %95 = "tpu.Conv2D"(%92, %93, %94) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1300865, 1423401, 1467117, 2598045, 980111, 2743405, 648907, 4671241, 871897, 1481525, 3493633, 1165433, 1414991, 1858269, 1628909, 1125971, 2735995, 1594615, 3645265, 358077, 803983, 2118065, 3594385, 2204665, 1148111, 3606699, 1457131, 1893331, 2663175, 2156725, 630769, 618147, 1224963, 989653, 194831, 1357961, 1631621, 1844739, 262779, 259265, 729371, 1369859, 984293, 308947, 1501555, 1702303, 443183, 1263299, 3962327, 2558175, 500645, 2107803, 2040871, 3009329, 811579, 502027, 1511207, 145967, 3497, 768045, 168911, 340367, 3131233, 5643, 768429, 512747, 1345329, 4044589, 1546705, 32895, 1163047, 2100203, 3732377, 729693, 1531847, 327589, 498233, 2233845, 1099385, 2355193, 1430419, 714547, 3155549, 2201137, 32735, 2281051, 1362595, 1903821, 395783, 411201, 4848195, 2125713, 757783, 3327575, 1920057, 392315, 177041, 196385, 1763489, 2740359, 558621, 3112129, 5988143, 3261881, 2332865, 1669429, 137073, 323977, 2303321, 2909901, 2107899, 1608181, 1551487, 8705, 686449, 893157, 2432321, 3642187, 1744635, 27743, 2217905, 1238517, 1490413, 2572821, 330149, 2216537, 1083441, 1875147], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [29, 29, 29, 29, 29, 30, 28, 30, 28, 29, 30, 29, 29, 29, 29, 29, 30, 29, 30, 27, 28, 29, 30, 30, 29, 30, 29, 29, 30, 30, 28, 28, 29, 28, 26, 29, 29, 30, 27, 26, 28, 29, 28, 27, 29, 29, 27, 29, 30, 30, 27, 29, 29, 30, 28, 27, 29, 26, 20, 28, 26, 27, 30, 21, 28, 28, 29, 30, 29, 24, 29, 29, 30, 28, 29, 27, 28, 30, 28, 30, 29, 28, 30, 30, 24, 30, 29, 29, 27, 27, 30, 29, 28, 30, 29, 27, 25, 26, 29, 30, 28, 30, 30, 30, 29, 29, 26, 27, 30, 30, 30, 29, 29, 22, 28, 28, 30, 30, 29, 23, 30, 29, 29, 30, 26, 30, 29, 29], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.014900897637795276>>, tensor<128x128x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.059924351181102363>> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc96)
    %97 = "tpu.Lut"(%95, %96) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.059924351181102363>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.042636174015748034>> loc(#loc97)
    %98 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc98)
    %99 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc99)
    %100 = "tpu.Conv2D"(%97, %98, %99) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [596085, 1112515, 407781, 29595, 117949, 393281, 477519, 420771, 1098707, 572743, 582465, 877619, 549277, 651857, 1403913, 29401, 408249, 812261, 147547, 358119, 36075, 464475, 114957, 154485, 1234829, 612345, 650593, 636069, 243173, 20329, 244103, 725749, 744813, 157727, 511431, 293907, 583207, 1289271, 1957229, 871763, 125819, 338755, 30953, 229121, 138037, 336675, 80837, 1613943, 618927, 857605, 669431, 932201, 153711, 291283, 583737, 374831, 315961, 172033, 503925, 496231, 939123, 827567, 598709, 1016031, 472569, 619827, 1076709, 1651449, 708703, 80529, 1157949, 644719, 324785, 311555, 1302631, 150417, 489147, 469961, 137865, 745909, 56889, 41123, 1708435, 80463, 84885, 583995, 809353, 822271, 214999, 330745, 274195, 105035, 946949, 146531, 395847, 222571, 254675, 360801, 710507, 792773, 1167625, 1755909, 679625, 1211191, 798507, 745043, 331257, 387661, 724135, 420079, 85, 367881, 96891, 172605, 51175, 690459, 843809, 427467, 309273, 121249, 176079, 664603, 168669, 108063, 619303, 692599, 823303, 1004543], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 30, 30, 25, 28, 29, 30, 30, 30, 30, 30, 30, 30, 29, 30, 25, 30, 30, 28, 29, 24, 29, 27, 29, 30, 30, 30, 30, 28, 24, 28, 30, 30, 28, 30, 29, 30, 30, 30, 30, 28, 28, 26, 29, 27, 29, 27, 29, 30, 30, 30, 30, 28, 29, 30, 29, 29, 28, 29, 29, 30, 30, 30, 30, 28, 30, 30, 30, 30, 28, 30, 30, 29, 29, 30, 28, 30, 29, 28, 30, 26, 26, 30, 27, 27, 29, 30, 30, 29, 29, 29, 28, 29, 28, 30, 29, 29, 29, 30, 30, 30, 30, 30, 30, 30, 30, 29, 29, 30, 30, 17, 29, 28, 28, 27, 30, 30, 30, 30, 28, 29, 30, 28, 28, 30, 30, 30, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.042636174015748034>>, tensor<128x128x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.055917454330708667>> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc101)
    %102 = "tpu.Lut"(%100, %101) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.055917454330708667>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.018550628346456693>> loc(#loc102)
    %103 = "tpu.Add"(%92, %102) {do_relu = false, multipliers = [95, 119], relu_limit = -1.000000e+00 : f64, rshifts = [7, 7]} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.014900897637795276>>, tensor<1x128x40x40x!quant.uniform<i8:f32, 0.018550628346456693>>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.02003296535433071>> loc(#loc103)
    %104 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc104)
    %105 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc105)
    %106 = "tpu.Conv2D"(%103, %104, %105) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [2724649, 2149115, 2526663, 3318073, 7554113, 882197, 3609471, 1203905, 1148529, 736577, 2724047, 2489159, 2288485, 778113, 5220393, 3271795, 1066375, 1359315, 2354447, 60973, 533067, 1376381, 1074631, 408363, 1080381, 2334443, 1735681, 878367, 3108251, 1528489, 532585, 1212077, 2609565, 1179115, 3794249, 589005, 3406209, 1572561, 1567671, 1771959, 2015053, 3238207, 2560907, 1133743, 1440339, 2311873, 1313673, 2798491, 1435817, 1411447, 1026609, 2085403, 902327, 1443569, 572405, 276457, 3940773, 2891893, 247073, 285119, 4167495, 2881915, 3102425, 1134457, 2559541, 1807919, 1241541, 3714999, 1176967, 2378817, 755441, 1284661, 5421273, 1476103, 1235401, 3964883, 2356413, 1774103, 2923601, 2425137, 316821, 3303293, 1434669, 2865735, 293115, 1485285, 300591, 237415, 5356473, 1155999, 1448485, 1586393, 508919, 1204857, 2909697, 1947839, 2525007, 119065, 1098541, 490369, 2327125, 6021261, 643053, 4570933, 1225233, 1931577, 2732459, 1330937, 531557, 2766147, 3055105, 1288113, 2041137, 3456559, 6530935, 192689, 2815477, 3093879, 1375977, 2425189, 1372379, 2681597, 3525793, 1977629, 479007, 2247201, 1341511, 1580417], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [30, 29, 30, 30, 30, 28, 30, 29, 29, 28, 30, 29, 30, 28, 30, 30, 29, 29, 30, 25, 27, 29, 28, 27, 29, 30, 29, 28, 30, 29, 27, 29, 30, 29, 30, 28, 30, 29, 30, 29, 29, 30, 30, 29, 29, 30, 29, 29, 29, 29, 29, 29, 28, 29, 27, 27, 30, 30, 26, 27, 30, 30, 30, 28, 30, 29, 29, 30, 29, 30, 28, 29, 30, 28, 29, 30, 29, 29, 30, 30, 27, 30, 29, 30, 27, 29, 27, 27, 30, 29, 29, 29, 27, 29, 30, 30, 30, 27, 28, 28, 30, 30, 28, 30, 29, 29, 30, 28, 27, 30, 30, 29, 30, 29, 30, 26, 30, 30, 29, 29, 29, 30, 30, 29, 28, 30, 29, 30], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.02003296535433071>>, tensor<128x128x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.051305083464566928>> loc(#loc106)
    %107 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc107)
    %108 = "tpu.Lut"(%106, %107) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.051305083464566928>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.039380272440944879>> loc(#loc108)
    %109 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc109)
    %110 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc110)
    %111 = "tpu.Conv2D"(%108, %109, %110) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [352783, 3469763, 4833, 219203, 283937, 1228793, 734269, 146559, 1395695, 827287, 1349479, 1879349, 177765, 763335, 713689, 1900643, 291669, 1593781, 9221, 1100093, 872983, 2196481, 846085, 376245, 128819, 598127, 935271, 820399, 535197, 287263, 1880297, 2617357, 2281921, 764671, 880131, 1827207, 2103659, 1357751, 181203, 1822631, 357115, 1227275, 1850443, 698563, 179603, 1414391, 1253391, 172251, 200545, 1273351, 490725, 15175, 2756461, 305925, 1931073, 2531825, 190545, 72499, 1278385, 562505, 1109699, 1091809, 913703, 562225, 1681335, 692605, 776693, 1897609, 177673, 1405695, 2077617, 1905385, 2442837, 210561, 2150643, 47665, 648415, 2464605, 788013, 1996115, 601695, 1000609, 211513, 100363, 1265005, 1388885, 351693, 369655, 1297947, 132783, 809747, 68077, 2713083, 90797, 69425, 38977, 710737, 163459, 1261209, 993419, 1013755, 2088155, 1552073, 1862573, 1461105, 2437545, 1280233, 550487, 855957, 1425925, 551813, 874163, 1899581, 1420609, 1642543, 821677, 2409795, 2043445, 285143, 641321, 106887, 336259, 1825885, 1214741, 1320817, 293765, 517521, 1204387], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [28, 30, 22, 27, 28, 29, 29, 27, 30, 30, 30, 30, 28, 29, 29, 30, 28, 30, 23, 30, 29, 30, 29, 28, 26, 29, 29, 29, 29, 27, 30, 30, 30, 29, 29, 30, 30, 30, 27, 30, 28, 29, 30, 29, 27, 30, 30, 27, 27, 30, 29, 24, 30, 28, 30, 30, 27, 25, 30, 29, 29, 30, 30, 29, 30, 29, 29, 30, 27, 30, 30, 30, 30, 27, 30, 25, 29, 30, 29, 30, 29, 30, 27, 26, 30, 30, 28, 28, 30, 27, 29, 26, 30, 25, 26, 25, 29, 27, 30, 29, 29, 30, 30, 30, 30, 30, 30, 29, 30, 30, 29, 29, 30, 30, 30, 29, 30, 30, 28, 29, 26, 28, 30, 30, 30, 27, 29, 28], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.039380272440944879>>, tensor<128x128x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.045380907874015747>> loc(#loc111)
    %112 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc112)
    %113 = "tpu.Lut"(%111, %112) : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.045380907874015747>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.029157995275590549>> loc(#loc113)
    %114 = "tpu.Add"(%103, %113) {do_relu = false, multipliers = [67, 49], relu_limit = -1.000000e+00 : f64, rshifts = [7, 6]} : (tensor<1x128x40x40x!quant.uniform<i8:f32, 0.02003296535433071>>, tensor<1x128x40x40x!quant.uniform<i8:f32, 0.029157995275590549>>) -> tensor<1x128x40x40x!quant.uniform<i8:f32, 0.038235908661417323>> loc(#loc114)
    %115 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc115)
    %116 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc116)
