#loc = loc(unknown)
#loc1 = loc("images")
module @yolov5s attributes {module.FLOPs = 16683511600 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "INT8", module.outputs = ["350_Transpose_f32", "498_Transpose_f32", "646_Transpose_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolov5s_tpu_addressed_bm1684x_int8_sym_weight.npz"} {
  module @yolov5s attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 8146944 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 8146944 : i64, module.neuron_addr = 4303114240 : i64, module.neuron_size = 13692928 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x640x640xf32> loc(unknown)) -> (tensor<1x3x80x80x85xf32, 4308643840 : i64>, tensor<1x3x40x40x85xf32, 4315172864 : i64>, tensor<1x3x20x20x85xf32, 4308234240 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [640, 640], scale = [0.0039216000586748123, 0.0039216000586748123, 0.0039216000586748123]} : (tensor<1x3x640x640xf32>) -> tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>, 4303114240 : i64> loc(#loc1)
      %1:3 = call @subfunc_0(%0) : (tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>, 4303114240 : i64>) -> (tensor<1x3x80x80x85xf32, 4308643840 : i64>, tensor<1x3x40x40x85xf32, 4315172864 : i64>, tensor<1x3x20x20x85xf32, 4308234240 : i64>) loc(#loc)
      return %1#0, %1#1, %1#2 : tensor<1x3x80x80x85xf32, 4308643840 : i64>, tensor<1x3x40x40x85xf32, 4315172864 : i64>, tensor<1x3x20x20x85xf32, 4308234240 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>, 4303114240 : i64> loc("images")) -> (tensor<1x3x80x80x85xf32, 4308643840 : i64>, tensor<1x3x40x40x85xf32, 4315172864 : i64>, tensor<1x3x20x20x85xf32, 4308234240 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "tpu.Cast"(%arg0) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x640x640x!quant.calibrated<f32<0.000000e+00:1.000008>>, 4303114240 : i64>) -> tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>, 4308029440 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x32x1x448xsi8, 4294967296 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4294983680 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4294987776 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295028736 : i64> loc(#loc6)
      %6 = "top.Weight"() : () -> tensor<1x32x1x128xsi8, 4295032832 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295036928 : i64> loc(#loc8)
      %8 = "top.Weight"() : () -> tensor<1x32x1x128xsi8, 4295041024 : i64> loc(#loc9)
      %9 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295045120 : i64> loc(#loc10)
      %10 = "top.Weight"() : () -> tensor<1x32x1x640xsi8, 4295049216 : i64> loc(#loc11)
      %11 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295069696 : i64> loc(#loc12)
      %12 = "top.Weight"() : () -> tensor<1x32x1x128xsi8, 4295073792 : i64> loc(#loc13)
      %13 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295077888 : i64> loc(#loc14)
      %14 = "top.Weight"() : () -> tensor<1x64x1x128xsi8, 4295081984 : i64> loc(#loc15)
      %15 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295090176 : i64> loc(#loc16)
      %16 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4295094272 : i64> loc(#loc17)
      %17 = "tpu.Group"(%1) ({
        %132 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 93440, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 116, 244, 372, 500], h_slice = [134, 146, 146, 146, 140], w_idx = [0], w_slice = [640], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 1 : i64} : (tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>, 4308029440 : i64>) -> tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>> loc(#loc19)
        %133 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 95488, out_size = 448, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [448], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x448xsi8, 4294967296 : i64>) -> tensor<1x32x1x448xsi8> loc(#loc20)
        %134 = "tpu.Load"(%3) {do_bcast = true, ginfo = #tpu.lg<out_addr = 95936, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4294983680 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc21)
        %135 = "tpu.Conv2D"(%132, %133, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 98304, out_size = 22720, buffer_addr = 121024, buffer_size = 136454, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 59, 123, 187, 251], h_slice = [66, 71, 71, 71, 69], w_idx = [0], w_slice = [320], id = 3, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [6, 6], kernel_zp = 0 : i64, pads = [2, 2, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 1 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>>, tensor<1x32x1x448xsi8>, none) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.32595742834645669>> loc(#loc22)
        %136 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 93440, out_size = 640, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [640], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x640xsi8, 4294987776 : i64>) -> tensor<1x64x1x640xsi8> loc(#loc23)
        %137 = "tpu.Lut"(%135, %134) {ginfo = #tpu.lg<out_addr = 0, out_size = 22720, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 59, 123, 187, 251], h_slice = [66, 71, 71, 71, 69], w_idx = [0], w_slice = [320], id = 5, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.32595742834645669>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x320x320x!quant.uniform<i8:f32, 0.29535947637795273>> loc(#loc24)
        %138 = "tpu.Load"(%5) {do_bcast = true, ginfo = #tpu.lg<out_addr = 258816, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295028736 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc25)
        %139 = "tpu.Conv2D"(%137, %136, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 5632, buffer_addr = 49152, buffer_size = 22528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x320x320x!quant.uniform<i8:f32, 0.29535947637795273>>, tensor<1x64x1x640xsi8>, none) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.37150840629921261>> loc(#loc26)
        %140 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 96192, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x128xsi8, 4295032832 : i64>) -> tensor<1x32x1x128xsi8> loc(#loc27)
        %141 = "tpu.Lut"(%139, %138) {ginfo = #tpu.lg<out_addr = 0, out_size = 5632, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 9, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.37150840629921261>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>> loc(#loc28)
        %142 = "tpu.Load"(%7) {do_bcast = true, ginfo = #tpu.lg<out_addr = 94720, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 10, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295036928 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc29)
        %143 = "tpu.Conv2D"(%141, %140, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 5632, buffer_addr = 32768, buffer_size = 22528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 11, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>>, tensor<1x32x1x128xsi8>, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.24746363149606301>> loc(#loc30)
        %144 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 96320, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 12, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x128xsi8, 4295041024 : i64>) -> tensor<1x32x1x128xsi8> loc(#loc31)
        %145 = "tpu.Lut"(%143, %142) {ginfo = #tpu.lg<out_addr = 5632, out_size = 5632, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 13, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.24746363149606301>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>> loc(#loc32)
        %146 = "tpu.Load"(%9) {do_bcast = true, ginfo = #tpu.lg<out_addr = 259072, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 14, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295045120 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc33)
        %147 = "tpu.Conv2D"(%145, %144, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 5632, buffer_addr = 16384, buffer_size = 22528, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 15, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>>, tensor<1x32x1x128xsi8>, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.11114269842519685>> loc(#loc34)
        %148 = "tpu.Load"(%10) {do_bcast = false, ginfo = #tpu.lg<out_addr = 94080, out_size = 640, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [640], id = 16, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x640xsi8, 4295049216 : i64>) -> tensor<1x32x1x640xsi8> loc(#loc35)
        %149 = "tpu.Lut"(%147, %146) {ginfo = #tpu.lg<out_addr = 11264, out_size = 5632, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 30, 62, 94, 126], h_slice = [33, 35, 35, 35, 34], w_idx = [0], w_slice = [160], id = 17, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.11114269842519685>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.10140994409448818>> loc(#loc36)
        %150 = "tpu.Load"(%11) {do_bcast = true, ginfo = #tpu.lg<out_addr = 261888, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 18, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295069696 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc37)
        %151 = "tpu.Conv2D"(%149, %148, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 5312, buffer_addr = 49152, buffer_size = 21248, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 19, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.10140994409448818>>, tensor<1x32x1x640xsi8>, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.095083035433070867>> loc(#loc38)
        %152 = "tpu.Lut"(%151, %150) {ginfo = #tpu.lg<out_addr = 65536, out_size = 5312, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 20, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.095083035433070867>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.088719262204724411>> loc(#loc39)
        %153 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 96448, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 21, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x128xsi8, 4295073792 : i64>) -> tensor<1x32x1x128xsi8> loc(#loc40)
        %154 = "tpu.Add"(%145, %152) {do_relu = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 5312, buffer_addr = 32768, buffer_size = 21248, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 22, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [69, 47], relu_limit = -1.000000e+00 : f64, rshifts = [8, 6]} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.032856783464566927>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.088719262204724411>>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc41)
        %155 = "tpu.Load"(%13) {do_bcast = true, ginfo = #tpu.lg<out_addr = 94976, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 23, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295077888 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc42)
        %156 = "tpu.Conv2D"(%141, %153, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 21696, out_size = 5312, buffer_addr = 32768, buffer_size = 21248, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 24, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.31670154330708666>>, tensor<1x32x1x128xsi8>, none) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.13293712362204724>> loc(#loc43)
        %157 = "tpu.Load"(%14) {do_bcast = false, ginfo = #tpu.lg<out_addr = 96576, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 25, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x128xsi8, 4295081984 : i64>) -> tensor<1x64x1x128xsi8> loc(#loc44)
        %158 = "tpu.Lut"(%156, %155) {ginfo = #tpu.lg<out_addr = 0, out_size = 5312, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 26, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.13293712362204724>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc45)
        %159 = "tpu.Concat"(%154, %158) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 5312, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 27, stage = 1, slice_idx = 0, group_type = 0>, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>, tensor<1x32x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12114059212598426>> loc(#loc46)
        %160 = "tpu.Load"(%15) {do_bcast = true, ginfo = #tpu.lg<out_addr = 95232, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 28, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295090176 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc47)
        %161 = "tpu.Conv2D"(%159, %157, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5312, buffer_addr = 16384, buffer_size = 21248, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 29, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.12114059212598426>>, tensor<1x64x1x128xsi8>, none) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.079613174015748023>> loc(#loc48)
        %162 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 257536, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1280], id = 30, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x1280xsi8, 4295094272 : i64>) -> tensor<1x64x1x1280xsi8> loc(#loc49)
        %163 = "tpu.Lut"(%161, %160) {ginfo = #tpu.lg<out_addr = 98304, out_size = 5312, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 31, 63, 95, 127], h_slice = [32, 33, 33, 33, 33], w_idx = [0], w_slice = [160], id = 31, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.079613174015748023>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x160x160x!quant.uniform<i8:f32, 0.08493915826771653>> loc(#loc50)
        %164 = "tpu.Conv2D"(%163, %162, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 259328, out_size = 2560, buffer_addr = 114688, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 16, 32, 48, 64], h_slice = [16, 16, 16, 16, 16], w_idx = [0], w_slice = [80], id = 32, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x160x160x!quant.uniform<i8:f32, 0.08493915826771653>>, tensor<1x64x1x1280xsi8>, none) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>> loc(#loc18)
        %165 = "tpu.Store"(%164, %0) {ginfo = #tpu.lg<out_addr = 259328, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 16, 32, 48, 64], h_slice = [16, 16, 16, 16, 16], w_idx = [0], w_slice = [80], id = 33, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>>, none) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>, 4310278144 : i64> loc(#loc18)
        "tpu.Yield"(%165) : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>, 4310278144 : i64>) -> () loc(#loc18)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 33, -2, 5, 4, -3, 7, 6, -4, 9, 8, -5, 11, 10, -6, 13, 12, -7, 15, 14, -8, 17, 16, -9, 19, 18, -10, 20, -11, 22, 21, -12, 24, 23, -13, 26, 25, -14, 27, -15, 29, 28, -16, 31, 30, -17, 32, 0, 1], group_type = 0 : i64, hsecs = 5 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-14, 1], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x640x640x!quant.uniform<u8:f32, 3.921600e-03>, 4308029440 : i64>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>, 4310278144 : i64> loc(#loc18)
      %18 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295176192 : i64> loc(#loc51)
      %19 = "top.Weight"() : () -> tensor<1x64x1x192xsi8, 4295180288 : i64> loc(#loc52)
      %20 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295192576 : i64> loc(#loc53)
      %21 = "top.Weight"() : () -> tensor<1x64x1x128xsi8, 4295196672 : i64> loc(#loc54)
      %22 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295204864 : i64> loc(#loc55)
      %23 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4295208960 : i64> loc(#loc56)
      %24 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295249920 : i64> loc(#loc57)
      %25 = "top.Weight"() : () -> tensor<1x64x1x128xsi8, 4295254016 : i64> loc(#loc58)
      %26 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295262208 : i64> loc(#loc59)
      %27 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4295266304 : i64> loc(#loc60)
      %28 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295307264 : i64> loc(#loc61)
      %29 = "top.Weight"() : () -> tensor<1x64x1x192xsi8, 4295311360 : i64> loc(#loc62)
      %30 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295323648 : i64> loc(#loc63)
      %31 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4295327744 : i64> loc(#loc64)
      %32 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295352320 : i64> loc(#loc65)
      %33 = "top.Weight"() : () -> tensor<1x64x1x4864xsi8, 4295356416 : i64> loc(#loc66)
      %34 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295667712 : i64> loc(#loc67)
      %35 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4295671808 : i64> loc(#loc68)
      %36 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295712768 : i64> loc(#loc69)
      %37 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4295716864 : i64> loc(#loc70)
      %38 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295741440 : i64> loc(#loc71)
      %39 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4295745536 : i64> loc(#loc72)
      %40 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295901184 : i64> loc(#loc73)
      %41 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4295905280 : i64> loc(#loc74)
      %42 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4295929856 : i64> loc(#loc75)
      %43 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4295933952 : i64> loc(#loc76)
      %44 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4296089600 : i64> loc(#loc77)
      %45 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4296093696 : i64> loc(#loc78)
      %46 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4296118272 : i64> loc(#loc79)
      %47 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4296122368 : i64> loc(#loc80)
      %48 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4296278016 : i64> loc(#loc81)
      %49 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4296282112 : i64> loc(#loc82)
      %50 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4296323072 : i64> loc(#loc83)
      %51 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4296327168 : i64> loc(#loc84)
      %52 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4296409088 : i64> loc(#loc85)
      %53 = "top.Weight"() : () -> tensor<1x64x1x18944xsi8, 4296413184 : i64> loc(#loc86)
      %54 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4297625600 : i64> loc(#loc87)
      %55 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4297629696 : i64> loc(#loc88)
      %56 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4297777152 : i64> loc(#loc89)
      %57 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4297781248 : i64> loc(#loc90)
      %58 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4297863168 : i64> loc(#loc91)
      %59 = "top.Weight"() : () -> tensor<1x64x1x9472xsi8, 4297867264 : i64> loc(#loc92)
      %60 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4298473472 : i64> loc(#loc93)
      %61 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4298477568 : i64> loc(#loc94)
      %62 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4298625024 : i64> loc(#loc95)
      %63 = "top.Weight"() : () -> tensor<1x64x1x4608xsi8, 4298629120 : i64> loc(#loc96)
      %64 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4298924032 : i64> loc(#loc97)
      %65 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4298928128 : i64> loc(#loc98)
      %66 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4299075584 : i64> loc(#loc99)
      %67 = "top.Weight"() : () -> tensor<1x64x1x8704xsi8, 4299079680 : i64> loc(#loc100)
      %68 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4299636736 : i64> loc(#loc101)
      %69 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4299640832 : i64> loc(#loc102)
      %70 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4299788288 : i64> loc(#loc103)
      %71 = "top.Weight"() : () -> tensor<1x64x1x1152xsi8, 4299792384 : i64> loc(#loc104)
      %72 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4299866112 : i64> loc(#loc105)
      %73 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4299870208 : i64> loc(#loc106)
      %74 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4299894784 : i64> loc(#loc107)
      %75 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4299898880 : i64> loc(#loc108)
      %76 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300054528 : i64> loc(#loc109)
      %77 = "top.Weight"() : () -> tensor<1x64x1x1152xsi8, 4300058624 : i64> loc(#loc110)
      %78 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300132352 : i64> loc(#loc111)
      %79 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4300136448 : i64> loc(#loc112)
      %80 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300218368 : i64> loc(#loc113)
      %81 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4300222464 : i64> loc(#loc114)
      %82 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300263424 : i64> loc(#loc115)
      %83 = "top.Weight"() : () -> tensor<1x64x1x320xsi8, 4300267520 : i64> loc(#loc116)
      %84 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300288000 : i64> loc(#loc117)
      %85 = "top.Weight"() : () -> tensor<1x64x1x128xsi8, 4300292096 : i64> loc(#loc118)
      %86 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300300288 : i64> loc(#loc119)
      %87 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4300304384 : i64> loc(#loc120)
      %88 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300345344 : i64> loc(#loc121)
      %89 = "top.Weight"() : () -> tensor<1x64x1x320xsi8, 4300349440 : i64> loc(#loc122)
      %90 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300369920 : i64> loc(#loc123)
      %91 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4300374016 : i64> loc(#loc124)
      %92 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300398592 : i64> loc(#loc125)
      %93 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4300402688 : i64> loc(#loc126)
      %94 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300558336 : i64> loc(#loc127)
      %95 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4300562432 : i64> loc(#loc128)
      %96 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300603392 : i64> loc(#loc129)
      %97 = "top.Weight"() : () -> tensor<1x64x1x384xsi8, 4300607488 : i64> loc(#loc130)
      %98 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300632064 : i64> loc(#loc131)
      %99 = "top.Weight"() : () -> tensor<1x64x1x2432xsi8, 4300636160 : i64> loc(#loc132)
      %100 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300791808 : i64> loc(#loc133)
      %101 = "top.Weight"() : () -> tensor<1x64x1x640xsi8, 4300795904 : i64> loc(#loc134)
      %102 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300836864 : i64> loc(#loc135)
      %103 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4300840960 : i64> loc(#loc136)
      %104 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4300922880 : i64> loc(#loc137)
      %105 = "top.Weight"() : () -> tensor<1x64x1x9472xsi8, 4300926976 : i64> loc(#loc138)
      %106 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4301533184 : i64> loc(#loc139)
      %107 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4301537280 : i64> loc(#loc140)
      %108 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4301684736 : i64> loc(#loc141)
      %109 = "top.Weight"() : () -> tensor<1x64x1x1280xsi8, 4301688832 : i64> loc(#loc142)
      %110 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4301770752 : i64> loc(#loc143)
      %111 = "top.Weight"() : () -> tensor<1x64x1x9472xsi8, 4301774848 : i64> loc(#loc144)
      %112 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4302381056 : i64> loc(#loc145)
      %113 = "top.Weight"() : () -> tensor<1x64x1x2304xsi8, 4302385152 : i64> loc(#loc146)
      %114 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4302532608 : i64> loc(#loc147)
      %115 = "top.Weight"() : () -> tensor<1x64x1x4608xsi8, 4302536704 : i64> loc(#loc148)
      %116 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 4302831616 : i64> loc(#loc149)
      %117 = "top.Weight"() : () -> tensor<1x64x1x768xsi8, 4302835712 : i64> loc(#loc150)
      %118:3 = "tpu.Group"(%17) ({
        %132 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 12800, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>, 4310278144 : i64>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>> loc(#loc154)
        %133 = "tpu.Load"(%18) {do_bcast = true, ginfo = #tpu.lg<out_addr = 212992, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295176192 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc155)
        %134 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 192, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [192], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x192xsi8, 4295180288 : i64>) -> tensor<1x64x1x192xsi8> loc(#loc156)
        %135 = "tpu.Lut"(%132, %133) {ginfo = #tpu.lg<out_addr = 0, out_size = 12800, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 3, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.052292868503937009>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x80x80x!quant.uniform<i8:f32, 0.039389724409448816>> loc(#loc157)
        %136 = "tpu.Load"(%20) {do_bcast = true, ginfo = #tpu.lg<out_addr = 49152, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295192576 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc158)
        %137 = "tpu.Conv2D"(%135, %134, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 6400, buffer_addr = 65536, buffer_size = 25600, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x80x80x!quant.uniform<i8:f32, 0.039389724409448816>>, tensor<1x64x1x192xsi8>, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024539233858267718>> loc(#loc159)
        %138 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 98304, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x128xsi8, 4295196672 : i64>) -> tensor<1x64x1x128xsi8> loc(#loc160)
        %139 = "tpu.Lut"(%137, %136) {ginfo = #tpu.lg<out_addr = 12800, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024539233858267718>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>> loc(#loc161)
        %140 = "tpu.Load"(%22) {do_bcast = true, ginfo = #tpu.lg<out_addr = 81920, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295204864 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc162)
        %141 = "tpu.Conv2D"(%139, %138, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 6400, buffer_addr = 49152, buffer_size = 25600, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>>, tensor<1x64x1x128xsi8>, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.043872662204724411>> loc(#loc163)
        %142 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 640, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [640], id = 10, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x640xsi8, 4295208960 : i64>) -> tensor<1x64x1x640xsi8> loc(#loc164)
        %143 = "tpu.Lut"(%141, %140) {ginfo = #tpu.lg<out_addr = 19200, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 11, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.043872662204724411>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047696196062992122>> loc(#loc165)
        %144 = "tpu.Load"(%24) {do_bcast = true, ginfo = #tpu.lg<out_addr = 98304, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 12, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295249920 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc166)
        %145 = "tpu.Conv2D"(%143, %142, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 6400, buffer_addr = 65536, buffer_size = 25600, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 13, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.047696196062992122>>, tensor<1x64x1x640xsi8>, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.03659276535433071>> loc(#loc167)
        %146 = "tpu.Lut"(%145, %144) {ginfo = #tpu.lg<out_addr = 65536, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 14, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.03659276535433071>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.021455972440944885>> loc(#loc168)
        %147 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 15, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x128xsi8, 4295254016 : i64>) -> tensor<1x64x1x128xsi8> loc(#loc169)
        %148 = "tpu.Add"(%139, %146) {do_relu = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 6400, buffer_addr = 81920, buffer_size = 25600, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 16, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [59, 113], relu_limit = -1.000000e+00 : f64, rshifts = [7, 7]} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.01122580157480315>>, tensor<1x64x80x80x!quant.uniform<i8:f32, 0.021455972440944885>>) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024273014960629922>> loc(#loc170)
        %149 = "tpu.Load"(%26) {do_bcast = true, ginfo = #tpu.lg<out_addr = 98304, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 17, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 4295262208 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc171)
        %150 = "tpu.Conv2D"(%148, %147, %0) {coeff_merged = true, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12800, out_size = 6400, buffer_addr = 65536, buffer_size = 25600, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [80], w_idx = [0], w_slice = [80], id = 18, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x80x80x!quant.uniform<i8:f32, 0.024273014960629922>>, tensor<1x64x1x128xsi8>, none) -> tensor<1x64x80x80x!quant.uniform<i8:f32, 0.041986418110236221>> loc(#loc172)
        %151 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 55552, out_size = 640, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [640], id = 19, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x640xsi8, 4295266304 : i64>) -> tensor<1x64x1x640xsi8> loc(#loc173)
